[
  {
    "id": "e58b5e5e-292a-4460-8dcc-07dd7437ae82",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e58b5e5e-292a-4460-8dcc-07dd7437ae82",
    "created_at": "Thu Feb 21 04:43:32 UTC 2019",
    "company": "Biteable",
    "company_url": "http://Biteable",
    "location": "Remote/Melbourne/Hobart",
    "title": "Front End Developer",
    "description": "<p>G’day. Biteable here. We are looking for a skilled and motivated front-end developer to strengthen our (very nice) development team. The team’s core values are quality, trust, curiosity, and positivity. If yours are too, then you’ll want to read on.</p>\n<p><strong>All about you</strong></p>\n<p><strong>You’re into what you do.</strong> And you love learning new things. You’re enthusiastic, collaborative, and have a desire to build on your experience.</p>\n<p><strong>You care about your team.</strong> You’re respectful, empathetic, humble, kind and considerate. You’re interested in how it’s going with your team. And you know it’s important they care about you.</p>\n<p><strong>You get work done.</strong> While simultaneously finding new, more efficient ways to achieve your goals.</p>\n<p><strong>You code good.</strong> Real good. And you’re experienced in delivering non-trivial web applications.</p>\n<p><strong>You speak multiple languages.</strong> You’re accomplished in JavaScript, CSS (or languages that compile to CSS like SASS, LESS, Stylus) and HTML.</p>\n<p><strong>You are fluent in mobile web.</strong> And you’re experienced at designing and building for it.</p>\n<p><strong>You’re good in different paradigms.</strong> You have an excellent understanding of programming paradigms. And you know all about OOP or FP.</p>\n<p><strong>You know Ember or Vue.</strong> It’s your hidden, bonus power.</p>\n<p><strong>Women strongly encouraged to apply.</strong></p>\n<p><strong>All about the role</strong></p>\n<p>Your main focus will be designing and authoring great code. Your tasks will be:</p>\n<ul>\n<li>Writing clear, concise, readable and easily maintainable code</li>\n<li>Contributing to team planning sessions</li>\n<li>Providing input on the design and build of features and products</li>\n<li>Reviewing code</li>\n<li>Deploying your work to production regularly and monitoring it after release</li>\n<li>Providing technical help for the customer support team as part of a rotating roster</li>\n</ul>\n<p><strong>All about us</strong></p>\n<p>We are Biteable, a tech start-up that makes (jaw-dropping) videos possible for everyone. We stand apart in our market thanks to our dedication to studio-quality content and our passion for simplicity.</p>\n<p>We’re growing fast and have offices in Melbourne and Hobart, Australia, with team members scattered around the world. We’re informal, structurally flat and fun to work with. Our biggest teams are engineering, studio, and marketing.</p>\n<p><em>All about your team</em></p>\n<p>You’ll be joining an established team of dedicated developers. They define themselves as supportive, rigorous, respectful, open, honest and egoless. Here’s why they choose to be part of Biteable:</p>\n<p>“Biteable's team of smart, funny, engaged and caring people makes my work here enjoyable, every day. Being close to decisions and decision-makers helps me make an impact on our work.”</p>\n<p>“The development team is a great group of people. They’re smart and interested in doing high-quality work, but foster a social and supportive atmosphere, too.”</p>\n<p>“I’m thankful for the flexibility Biteable gives me around my family commitments. I really like that my team is open to new ideas and processes. And I enjoy that I get to work on a variety of problems with a mix of people with diverse areas of expertise.”</p>\n<p><strong>How to apply</strong></p>\n<p>Write to us <a href=\"mailto:jobs@biteable.com\">jobs@biteable.com</a>. Attach your CV and a killer cover letter. We’d ¯lso love to hear about what you see as the biggest challenges facing front-end development and what you think the future holds. The next step is a coding challenge and a video interview. If it feels good for both of us, you’ll be joining us at Biteable HQ faster than you can say, “Beck and Fowler.”</p>\n",
    "how_to_apply": "<p>Write to us <a href=\"mailto:jobs@biteable.com\">jobs@biteable.com</a>. Attach your CV and a killer cover letter. We’d also love to hear about what you see as the biggest challenges facing front-end development and what you think the future holds.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGhmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6b0eb052e98731c32fac32696c122a60565917af/biteable_logo_cyan.png"
  },
  {
    "id": "8633a983-1303-4579-8990-e77a236dd4bb",
    "type": "Part Time",
    "url": "https://jobs.github.com/positions/8633a983-1303-4579-8990-e77a236dd4bb",
    "created_at": "Thu Feb 21 02:47:32 UTC 2019",
    "company": "Ruby Together",
    "company_url": "https://rubytogether.org",
    "location": "Remote",
    "title": "Head of Growth",
    "description": "<h3>About Ruby Together</h3>\n<p>Ruby Together exists to make Ruby open source made better for everyone, by using funding from the community to pay developers to maintain the open source tools that Ruby software is built on. Bundler, RubyGems.org, and other Ruby open source tools have millions of users and power the software behind trillions of dollars worth of businesses. Despite those numbers, each tool has spent years with just 1 or 2 people sacrificing their personal time during nights and weekends to keep things working.</p>\n<p>Our goal as a company is to create and sustain a new model of community funding for open source software, by paying open source developers for their work, and providing reliable and well-maintained tools for everyone in the community to use and depend on. For more detail, check out our<a href=\"https://github.com/rubytogether/board/blob/master/VISION_MISSON_VALUES.md\"> Vision, Mission, and Values</a>, as well as<a href=\"http://rubytogether.org/\"> our website, rubytogether.org</a>.</p>\n<h3>What We Are Looking For</h3>\n<p>As the first growth-related hire for Ruby Together, this individual will lay the foundation for engaging current and future Ruby Together members in a meaningful way. Part membership recruitment, part happiness maintainer, we are looking for someone who is excited about the Ruby community, open source, and engaging with developers and engineering management about supporting Ruby Together.</p>\n<p>This is a great opportunity for an individual with previous community building experience, an ability to be creative and provide outside-the-box ideas, and a level of professionalism and persistence that allows them to follow up with individuals and companies in a meaningful way. </p>\n<p>We expect this position to be approximately 20 hours per week with some travel involved.</p>\n<p>This position is remote-friendly, and will most likely involve travel to attend and/or speak at conferences.</p>\n<h3>Responsibilities and Expectations</h3>\n<ul>\n<li>Work with the executive director to reach out to potential company sponsors</li>\n<li>Engage with RT members, companies, and potential members and companies to increase excitement and interest in Ruby Together</li>\n<li>Plan and run Ruby Together events at national and regional conferences</li>\n<li>Provide active Ruby Together members with ways to engage their communities at local meetups and encourage others to become members of Ruby Together</li>\n<li>Write regular blog posts for various media to promote the Ruby Together organization and projects</li>\n<li>Create a community engagement and outreach strategy to increase knowledge of and interest in Ruby Together</li>\n<li>Recruit and manage regional ambassadors</li>\n</ul>\n<h3>Compensation</h3>\n<ul>\n<li>Salary of $80,000, with work expected to be roughly half-time</li>\n<li>Expenses reimbursed for working conferences</li>\n<li>7 days per year of PTO</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://ruby-together.breezy.hr/p/3d0aae712e8f-head-of-growth\">Fill out an application today!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFZmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--117137517e68227638af77fce6562b2316ef042e/rubies.png"
  },
  {
    "id": "6c079c20-dbac-4cc4-a66c-135f968c2e5c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6c079c20-dbac-4cc4-a66c-135f968c2e5c",
    "created_at": "Wed Feb 20 19:31:29 UTC 2019",
    "company": "LAShowroom.com",
    "company_url": "http://lashowroom.com",
    "location": "110 East 9th Street, Los Angeles, CA 90079",
    "title": "Back End Developer ",
    "description": "<p>Back End Developer</p>\n<p>We are looking to expand our development team with passionate back-end developers that love building scalable, maintainable, and optimized web applications. We are currently in the process of modernizing our code base and our infrastructure, so if you love Symfony2, Ansible, Galera, Vagrant, Docker, testing, and best practices, we have an exciting opportunity for you. Our web development team consists of a diverse group of developers who love coding in PHP and JavaScript, but also other languages. Our current stack consists of, but is not limited to PHP 5 (Symfony 2 and Laravel 4), MySQL, Redis, Memcached, Elastic, CentOS and Ubuntu.</p>\n<p>Requirements:</p>\n<ul>\n<li>At least 5 years of professional programming experience.</li>\n<li>2+ years of professional experience working in PHP 5 and MySQL/PostgreSQL.</li>\n<li>Experience with Symfony2 or Laravel is a plus.</li>\n<li>Experience with Redis, Memcached or NoSQL databases is a plus.</li>\n<li>Experience with HTML5, CSS3, and JavaScript.</li>\n<li>Experience working with PCI compliant code, payment gateways and server environments is a plus.</li>\n<li>Experience contributing to OSS is a plus.</li>\n<li>Experience with DevOps is a plus.</li>\n<li>Experience developing on a LAMP stack.</li>\n<li>Experience with nginx and PHP-FPM is a plus.</li>\n<li>Experience with unit testing is a plus.</li>\n<li>Experience with Source Control Systems (SVN and/or GIT).</li>\n<li>Experience with software development life-cycle including design and implementation, unit testing, and production deployment.</li>\n<li>Experience in E-commerce development and maintenance.</li>\n<li>Bachelor of Science in Computer Science or strong OOP/OOD experience.</li>\n<li>Must have strong verbal and written communication skills.</li>\n</ul>\n<p>About LA Showroom, Inc.:</p>\n<p>LA Showroom is one of the largest online wholesale fashion marketplaces in the world, connecting fashion designers and apparel manufacturers and distributors to buyers, boutiques, and retailers from around the world.</p>\n<p>Through our online shopping destination, fashion designers, manufacturers and distributors are able to eliminate physical boundaries, and are able to reach new buyers quickly and inexpensively.</p>\n<p>Our registered buyers are able to place orders with multiple manufacturers and wholesalers through one convenient account and gain access to thousands of new styles daily. LAShowroom.com caters to hundreds of members in the Los Angeles Fashion District, and tens of thousands of buyers worldwide, providing them with a centralized place to conduct business to business transactions.</p>\n<p>Our office is located in the heart of the Fashion District of Downtown Los Angeles. We offer competitive salary and full benefit package including: Health, Dental, Paid Time Off, Holidays, Life Insurance, LTD and 401(k).</p>\n<p>This is a FULL-TIME, IN-HOUSE position. NO CONTRACTORS, NO FREELANCERS, and NO TELECOMMUTING, PLEASE. LOCAL CANDIDATES ONLY.</p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@lashowroom.com\">careers@lashowroom.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE5mIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c26504269effe6442181da2268b413947015c286/LAS4.JPG"
  },
  {
    "id": "f5401395-6a7f-4988-9111-0bde883f8a2f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f5401395-6a7f-4988-9111-0bde883f8a2f",
    "created_at": "Wed Feb 20 17:38:20 UTC 2019",
    "company": "The Children's Museum of Indianapolis",
    "company_url": "http://www.childrensmuseum.org",
    "location": "Indianapolis",
    "title": "Interactive Technology Developer",
    "description": "<p>OVERVIEW:\nThe Interactive Technology Developer is primarily responsible for developing, planning, and designing world-class interactive technology-driven experiences for The Children’s Museum of Indianapolis.  The incumbent works with internal colleagues to create appropriate interactive technology deliverables that are informed by general learning theory, meet museum standards, help drive new and repeat visitation, and advance family learning. The Developer works in concert with exhibit developers and designers to deliver appropriate, compelling exhibit experiences (see photos of examples on our website: <a href=\"https://www.childrensmuseum.org/exhibits/beyond-spaceship-earth\">https://www.childrensmuseum.org/exhibits/beyond-spaceship-earth</a>). He/she works with technical programming and graphic design.</p>\n<p>ESSENTIAL RESPONSIBILITIES:</p>\n<ol>\n<li>\n<p>Leads the development of dynamic interactive technologies for exhibits, experiences, and online initiatives in conjunction with staff colleagues. Develops digital interactives as informed by general learning theory.\na.\tDevelops and designs technology-driven exhibit experiences, participating in each phase of the project from storyboards and prototypes to functional design to launch.\nb.\tDevelops and designs educational and promotional mobile apps -including phone and tablet apps for iOS and Android operating systems.</p>\n</li>\n<li>\n<p>Assists in designing and implementing analytics tools to determine the effectiveness of interactive technology deliverables as it relates to family learning.  Develops measurements for guest interaction with exhibit interactives, assessing data with team to determine what works to create the best family learning experiences.</p>\n</li>\n<li>\n<p>Conceptualizes exhibit games and activities working with exhibit and programs staff to ensure they reflect sound instructional design principles and meet family learning and instructional goals. Identifies and recommends the right technology to meets the needs of a project.</p>\n</li>\n<li>\n<p>Participates in user testing by developing paper and functional prototypes, conducting one-on-one user testing and participating in focus groups to ensure the effectiveness of interactive technology deliverables.</p>\n</li>\n<li>\n<p>Assists other departments in the design and development of digital technologies that include interactives, applications, videos and integrated social media engagement tools that function across onsite, online and mobile experiences.</p>\n</li>\n<li>\n<p>Researches emerging technologies and stays abreast of industry trends in order to make recommendations that continually improve the quality and efficiency of interactive technology deliverables.</p>\n</li>\n</ol>\n<p>REQUIREMENTS:</p>\n<ol>\n<li>Bachelor’s degree in computer technology, educational technology, informatics or related field, or equivalent experience.</li>\n<li>Three (3) years’ experience in development and design of interactive technologies.  Strong K-12 educational technology expertise utilizing instructional design technology preferred.</li>\n<li>Strong technical skills with proven expertise in creative media technologies, including but not limited to Unity, GitHub/GitLab, C#, Adobe Creative Suite, HTML5, CSS, Javascript, PHP and 3-D design/animation software such as 3D Studio Max.</li>\n<li>Strong graphic design skills.</li>\n<li>Familiar with and competent in utilizing video editing and post-production tools such as Premiere and AfterEffects.</li>\n<li>Excellent oral and written communication skills.  Strong collaboration skills and the ability to work with diverse teams on conceptual, intellectual and artistic development of technology components/activities for galleries and the museum website.</li>\n<li>The ability to work effectively with outside contractors.</li>\n</ol>\n<p>ADA REQUIREMENTS:</p>\n<ol>\n<li>Must be able to view computer monitor, computer reports, and all technical manuals.</li>\n<li>Must be able to communicate extensively and effectively via telephone/TDD, one-on-one conversations and conduct public presentations.</li>\n<li>Requires extensive use of computer keyboards and other technical equipment.</li>\n<li>Candidate must have the ability to tolerate local and national travel, and sit or stand for extended periods of time; must be able to lift up to 30lbs.</li>\n<li>Must be able to concentrate, focus attention and ignore distractions.</li>\n</ol>\n",
    "how_to_apply": "<p>Apply here:  <a href=\"https://recruiting.ultipro.com/CHI1023/JobBoard/6f16dad2-aeb7-b3ae-7e8c-63d0684114fc/OpportunityDetail?opportunityId=c2d4bf81-9a48-48f1-a918-51e9e32af4ca\">https://recruiting.ultipro.com/CHI1023/JobBoard/6f16dad2-aeb7-b3ae-7e8c-63d0684114fc/OpportunityDetail?opportunityId=c2d4bf81-9a48-48f1-a918-51e9e32af4ca</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzVmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f5958eab5be083c2165bcf390de70bd51042e57d/TCM_Logo_small.jpg"
  },
  {
    "id": "b42ccb00-294f-4436-a42c-1195948d2d0a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b42ccb00-294f-4436-a42c-1195948d2d0a",
    "created_at": "Wed Feb 20 17:29:51 UTC 2019",
    "company": "Stealth Startup",
    "company_url": "http:",
    "location": "Remote",
    "title": "Lead Backend Developer",
    "description": "<p>** About the Company **</p>\n<p>Founded in 2006, we are a privately held company in the performance advertising space. Over the past decade, we have earned and secured a reputation as industry leaders, known for using cutting edge technology and strategy for leveraging real-time predictive analytics to show users the right ads at the right time. We are headquartered in Australia with additional offices in India and China. Our team of 75+ has done over $3B in advertising spend. In 2018 alone, we generated over $50M in revenue.</p>\n<p>** Why Stealth? **</p>\n<p>This job post will remain in stealth mode, but we will disclose full company details during the the interview process.</p>\n<p><strong>Role</strong></p>\n<p>We have identified an exciting new advertising niche and are building out a lean team to tackle the opportunity head-on. This subdivision will report directly to a member of the executive team. Due to the competitive nature of the advertising space, we will not be disclosing details concerning the niche here..</p>\n<p>This subdivision will create a specialty web application that enables publishers to:</p>\n<ul>\n<li>Command and control their advertising network’s ad tags from a single central system.</li>\n<li>Access detailed analytics about their existing revenue streams.</li>\n<li>Mediate existing advertising ad tags to increase revenue through algorithms</li>\n<li>Strike direct deals with advertisers</li>\n</ul>\n<p>You will focus primarily on the development of all server-side logic and ensuring high performance and responsiveness to requests from the front-end. Because you will be working with frontend developers to provide APIs, a basic understanding of front-end technologies is necessary.</p>\n<p>** You Should Apply If **</p>\n<ul>\n<li>You are an experienced engineer and like working with a lean team. The team will be comprised of one executive team member, a front-end developer, a back-end developer (yourself), and a business development expert (for the first 3 months)</li>\n<li>You have agency and can think</li>\n<li>You are responsible and can be held accountable for your code</li>\n<li>You like working on MVPs, i.e. “move fast and break things”</li>\n<li>You want to work with experienced entrepreneurs and learn how to build an ROI-positive business</li>\n</ul>\n<p><strong>Compensation</strong></p>\n<ul>\n<li>$96,000-$144,000 per year, commensurate with experience .</li>\n<li>Monthly profit sharing.</li>\n<li>Equity</li>\n</ul>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Building and maintaining an Express-based Node.js API for the front-end to use</li>\n<li>Writing reusable, testable, and efficient code</li>\n<li>Implementing security and data protection</li>\n<li>Optimizing the application for maximum speed and scalability</li>\n</ul>\n<p><strong>Skills and Qualifications</strong></p>\n<ul>\n<li>BSc degree in Computer Science or relevant field</li>\n<li>5+ years of experience as a backend developer</li>\n<li>Experience working with large amounts of data which needs to be stored, processed, and accessed reliably</li>\n<li>Experience with Kafka, Storm, Spark, Druid</li>\n<li>Strong proficiency with JavaScript (experience in TypeScript is a plus)</li>\n<li>Knowledge of Node.js and frameworks available for it such as Express, Mongoose, etc.</li>\n<li>Basic understanding of front-end technologies, such as HTML5, and CSS3 (experience in Angular is a plus)</li>\n<li>Hands-on experience in Python, Ruby, Java or C# is a plus</li>\n<li>Experience creating RESTful APIs</li>\n<li>Experience in implementing automated testing platforms and unit tests</li>\n<li>Proficient understanding of code versioning tools such as Git</li>\n<li>Understanding fundamental design principles behind a scalable application</li>\n<li>Integration of multiple data sources and databases into one system</li>\n<li>Excellent analytical and time management skills</li>\n<li>Management of hosting environment, including database administration and scaling an application to support load changes.</li>\n</ul>\n",
    "how_to_apply": "<p>Fill out our google application here\n<a href=\"https://bit.ly/2SPMFi8\">https://bit.ly/2SPMFi8</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3hmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e535920a5d6865a08a43e1280384b5319d1a40d7/download.png"
  },
  {
    "id": "f3d3c85c-9d4f-42b1-ba98-e21271e68941",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f3d3c85c-9d4f-42b1-ba98-e21271e68941",
    "created_at": "Wed Feb 20 17:23:03 UTC 2019",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "location": "Cupertino, CA",
    "title": "Analytics Metrics Engineer, Apple Media Products, Analytics Engineering",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n<p>Job Summary:\nAMP Analytics Engineering team is looking for an engineer who will help onboard new engineering client teams to our analytics platform. Our platform is highly-performant and allows teams inside Apple perform effective analyses of user behavior while protecting user privacy.</p>\n<p>Our team is developing frameworks and tools to collect user experience metrics from client applications. This data will be used to generate insights into customer experiences on products such as App Store, Apple Music, iTunes Store, Books, Podcasts, TV.</p>\n<p>Key Qualifications:</p>\n<ul>\n<li>Posses the leadership skills and gravitas to drive conversations with outside groups regarding analytics instrumentation</li>\n<li>Ability to understand the big picture while also being able to dive into technical details to solve problems</li>\n<li>Self-motivated and enthusiastic with demonstrated creative and critical thinking capabilities</li>\n<li>Excellent verbal and written communication</li>\n<li>Takes initiative to solve problems and improve product</li>\n<li>Great attention to detail</li>\n<li>Object-oriented design skills, coupled with a knowledge of data structures and algorithms</li>\n<li>Development experience in some or all of: C/C++, Objective-C, Swift, JavaScript, Java is preferable</li>\n<li>Experience working on a metrics or analytics system is a plus</li>\n</ul>\n<p>Description:\nThe Apple Media Products (AMP) Analytics Engineering team provides a collection of services, frameworks and tools for collecting and aggregating application metrics. These metrics can be used to analyze user behavior, customer preferences, measure performance and improve software design.\nYou will be working on a small team valuing cooperation, brainstorming, with an emphasis on design. You will be responsible for:</p>\n<ul>\n<li>Facilitating the onboarding process for new client teams</li>\n<li>Designing new pieces of functionality / architecture / API which requires deep understanding of existing analytics platform</li>\n<li>Gathering cross-functional requirements and translating them into practical engineering tasks</li>\n<li>Helping clients translate business / engineering requirements into instrumentation specification that will be used by client engineers, analysts and QA</li>\n<li>Collaboratively work with Privacy engineers to come up with creative solutions for protecting user privacy\nThe position requires to know the analytics platform really well, be able to give an overview and answer any integration related questions.</li>\n</ul>\n<p>Education:\nBS degree in Computer Science or a related field preferred.</p>\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n<p>REQUISITION NUMBER: 200035124\nCOMPANY NAME: Apple Inc.</p>\n",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=e0b0b5c713733d3b39ae381898826cbd\">Apply here</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3BmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0a552192b7ff142074026146ee6328f7eecd53d9/Apple_300x300.jpeg"
  },
  {
    "id": "dabcbe6f-8583-402a-855a-677bff301a12",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/dabcbe6f-8583-402a-855a-677bff301a12",
    "created_at": "Wed Feb 20 14:04:48 UTC 2019",
    "company": "i2x GmbH",
    "company_url": "https://i2x.ai/",
    "location": "Berlin, Germany",
    "title": "Software Engineer - Backend (m/f/d)",
    "description": "<p>At i2x, we are building AI to help people improve the way they communicate. With focus on speech and text analysis, we are shaping the future of communication. We are looking for engaged and enthusiastic Software Engineers to join our Backend team.</p>\n<p>This is how we work:</p>\n<p>We’re building a new product. This means: (almost) no legacy code or support! You’ll be joining us to shape i2x</p>\n<p>We like to keep teams small with a maximum of 4 engineers, where everyone is responsible for the development, deployment and operation</p>\n<p>We continuously improve the i2x product and bring our ideas to life</p>\n<p>We collaborate closely with engineers from other teams. They are all excellent and you’ll enjoy to further grow our teams vision with them</p>\n<p>We simply enjoy designing, developing and deploying scalable and highly available fault-tolerant backend services</p>\n<p>Your profile:</p>\n<p>Degree or equivalent experience in Computer Science, Engineering, Mathematics or related field\nStrong grasp of algorithms and data structures\nProficient Linux user\nSolid English communication skills</p>\n<p>Must-Haves:</p>\n<p>System design skills\nExperience with SQL (e.g. PostgreSQL, MySQL) and NoSQL (e.g. MongoDB, Cassandra)\nProficient in Python and / or C++</p>\n<p>Nice-to-have:</p>\n<p>Experience implementing RESTful, GraphQL APIs\nExperience implementing microservices with RPC APIs (Thrift / GRPC)\nProficiency with monitoring tools and frameworks\nUnderstanding of containerization, hands-on experience with Docker\nExperience with web frameworks</p>\n<p>What we offer:</p>\n<p>Exciting challenges which involve a mix of advanced research and high-quality engineering\nHigh degree of autonomy\nOwnership over your role and functional area\nFlat hierarchy and open communication\nComplete transparency into the rest of the company\nWorking with international, highly engaged people\nEducation budget to attend conferences or trainings\nChoice of hardware</p>\n<p>Sounds interesting to you? Then send your application to <a href=\"mailto:career@i2x.ai\">career@i2x.ai</a>! We're looking forward to hearing from you.</p>\n",
    "how_to_apply": "<p><a href=\"mailto:career@i2x.ai\">career@i2x.ai</a></p>\n",
    "company_logo": null
  },
  {
    "id": "561f3d14-92c4-4367-bc73-64cf89de841a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/561f3d14-92c4-4367-bc73-64cf89de841a",
    "created_at": "Wed Feb 20 12:31:25 UTC 2019",
    "company": "Brayn.io",
    "company_url": null,
    "location": "Berlin ",
    "title": "Backend /  Full Stack Developer (m/f/d) ",
    "description": "<p>Full Stack Developer (m/f/d)</p>\n<p>Brayn.io is a brand of Secu-ring GmbH who has been developing digital products for\nmore than 10 years. We focus on the development of cloud based digital business models. We work for startups as well as small and medium sized companies who are increasingly digitalizing their businesses.</p>\n<p>These are your new tasks at brayn.io:</p>\n<p>•You’re responsible for designing, developing and implementing modern web applications\n•You develop new features with Vue.js, create tests and manage code reviews.\n•You work in weekly sprints and deploy on a regular basis\n•You  love  to  share  your  knowledge  to  new colleagues  and  to  develop  you  and  your  team\nfurther</p>\n<p>Some examples from our technology stack:\n•Scala and Play Framework\n•Java Script, Bootstrap, Vue.js, Angular, React JS\n•PHP5/7, ZF2, Doctrine, Zend Apigility\n•HTML, CSS3, (SASS)\n•MySQL, SQL, NoSQL –MongoDB\n•GitLab\n•Docker, basic UNIX skills\n•Behat, Unit-Testing</p>\n<p>You fit to our team if</p>\n<p>•You own an university degree in Computer Science or a vocational training with several years\nof work experience.\n•You can prove work experience with single page apps\n•You made some practical experience with agile development techniques\n•You bring a structural and systematic way of working as well as analytical skills\n•You speak English and want to learn some German</p>\n<p>What we offer</p>\n<p>•You work in a highly motivated team in which you’re responsible for monitoring and\ndeveloping code by yourself\n•A  management  which  sees  itself as  part  of  the  team  and  a  work  surrounding  that  creates\nnew digital business models\n•An open door policy to actively promote an open dialogue\n•Individual development and qualification opportunities in your area of expertise\n•Free coffee, tea, fruits and snacks</p>\n<p>We support each otherunconditionally and fulfill a common mission.\nBrayn.io is growing – so take the chance to grow with us.</p>\n<p>Your application\nWe’re looking forward to receiving your  meaningful  and  individual  application!  If  you  have  any\nquestions do not hesitate to contact Susann (030/916848-31, <a href=\"mailto:susann@brayn.io\">susann@brayn.io</a>).\nbrayn.io\nSecu-ring GmbH\nWönnichstr. 68/70\n10317 Berlin\n<a href=\"http://www.brayn.io\">www.brayn.io</a></p>\n",
    "how_to_apply": "<p><a href=\"mailto:susann@brayn.io\">susann@brayn.io</a></p>\n",
    "company_logo": null
  },
  {
    "id": "9a52e015-d1b5-4b95-8c34-c41f3a35b507",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9a52e015-d1b5-4b95-8c34-c41f3a35b507",
    "created_at": "Wed Feb 20 11:39:32 UTC 2019",
    "company": "IceMobile",
    "company_url": "https://www.icemobile.com/",
    "location": "Amsterdam",
    "title": "Solution Architect",
    "description": "<p><em>Are you ready to be the customer’s primary source of expertise on all IceMobile products?</em></p>\n<p><strong>Fulltime</strong>\nIceMobile has an exciting career opportunity for a Solutions Architect. In this role, you are the primary technical point of contact with our customers supporting the IceMobile team in Europe. You are responsible for product implementations at our customers and how they integrate to achieve customers’ project goals. To achieve this, you will guide technical teams through various aspects of our product suite implementations.</p>\n<p><strong>What are your responsibilities?</strong></p>\n<p>The role of Solutions Architect is a very comprehensive one. Besides providing strong technical leadership and guidance to all stakeholders you will be involved in building lasting relationships with our clients as well as creating technical specifications. You will be working with project managers on delivering solutions in time as well as providing technical guidance to both client and internal teams on all levels of their technology stacks.</p>\n<p><strong>Who are you?</strong></p>\n<ul>\n<li>Excellent communication and leadership skills.</li>\n<li>Experience with software &amp; product development and service-oriented architectures</li>\n<li>Experience designing and implementing systems that expose REST-based APIs</li>\n<li>Experience designing technical integrations and cloud architectures</li>\n<li>Familiarity with native app development for iOS and Android as well as responsive web applications</li>\n<li>Hands-on experience in developing high performance, cloud-based, applications</li>\n<li>Consulting experience in a commercial environment to help you manage stakeholders</li>\n<li>Expertise presenting your findings creatively &amp; interactively, either one-on-one or to a crowd</li>\n<li>Experience developing use cases, analyzing requirements, user stories, design and architecture specifications.</li>\n</ul>\n<p><strong>What do we offer?</strong></p>\n<p>At IceMobile we like to take care of each other:</p>\n<ul>\n<li>Competitive salary;</li>\n<li>Challenging role in a diverse international environment with the opportunity to grow into one of the product teams;</li>\n<li>Foodies at heart: We have our own healthy canteen with lunch &amp; snacks all day long;</li>\n<li>Apple addicts: Great iMac or MacBook to work with;</li>\n<li>Development: Opportunity to develop and grow and an extensive training budget;</li>\n<li>Future: Great pension arrangements and insurances;</li>\n<li>Sporty Bits: Free usage of Gym, yoga, summer kickboxing classes, epic ski-trips, and other internal sports like running competitions and playing basketball</li>\n<li>Celebrate: Friday drinks and did we mention we brew our own beer in the office?</li>\n</ul>\n<p><strong>Interested?</strong></p>\n<p>Please apply via the <strong><a href=\"http://tinyurl.com/y344r4f8\">link</a></strong> button</p>\n",
    "how_to_apply": "<p><a href=\"http://tinyurl.com/y344r4f8\">Click here to apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0ZmIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--180344d2cad9070f4bad19e6999f0e48690af045/icemobile.jpg"
  },
  {
    "id": "0647554c-90b9-465b-8810-5eee93ec99d9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0647554c-90b9-465b-8810-5eee93ec99d9",
    "created_at": "Tue Feb 19 19:26:07 UTC 2019",
    "company": "Articulate",
    "company_url": "https://articulate.com",
    "location": "Anywhere in United States (Remote)",
    "title": "Full-Stack Software Engineer",
    "description": "<p>Articulate is looking for a Full-Stack Software Engineer. We’re makers. We believe the job of a development team is more than just writing code. We are here to create experiences which delight our customers—that is always our top priority.</p>\n<p>We’re a fully distributed company with a high degree of autonomy and no office space. At Articulate, you’ll work closely with an awesome team of developers and designers to build industry-leading products and solve interesting problems.</p>\n<p>The ideal person for this job is a multitalented Full-Stack Software Engineer with a good eye. This person sweats the details, focuses on quality results instead of effort, and sees problems as opportunities to learn and level up as a team. Solid GIF skills and emojis game are big bonuses.</p>\n<p>Here’s a smattering of the tech you’ll be working with: Node.js, React, JavaScript, CSS, AWS, GitHub, and Slack.</p>\n<p><strong>About Articulate</strong></p>\n<p>Articulate is a highly successful, fully remote software company that’s changing the way the world learns. Our award-winning e-learning tools are used by 78,000+ organizations across the globe to create engaging online and mobile courses. Our customers include 93 of the Fortune 100 and 19 of the top 20 U.S. universities. And our online community of 605,000+ members is the largest, fastest-growing community in the industry.</p>\n<p>We empower employees to thrive by fostering a culture of autonomy, productivity, and respect. We’re all free to exercise our crafts the best way we know how to reach our goals as individuals and teams. Each and every one of us is focused on producing results that directly impact the company’s success. And we all strive to do what’s right by people, both internally and externally, instead of taking the shortest route to the highest profits.</p>\n<p>We honor people’s humanity in all of our disparate experiences and social locations, accepting each person as an individual with a story worth listening to and honoring. We believe that honoring everyone’s humanity means being committed to equity and justice. We welcome different voices and viewpoints and do not discriminate on the basis of race, religion, color, national origin, ancestry, physical and/or mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, transgender status, age, sexual orientation, and military or veteran status, or any other basis protected by law. We are an equal opportunity employer and invite applicants to voluntarily disclose their race and gender on our application form to help us create a diverse company. This voluntarily disclosed information will not be shared with any hiring manager and will be kept in confidence by the Articulate human resources department and executives who are not hiring for this position.</p>\n<p><a href=\"https://articulate.com/company/culture\">Learn more about our culture.</a></p>\n",
    "how_to_apply": "<p>Visit <a href=\"https://articulate.fyi/2DY6aed\">https://articulate.fyi/2DY6aed</a> to apply.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVZlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b2fd5b4cd6f9b339800a0ac04ff1985fee18bf8d/F3ijuGTr_400x400.jpg"
  },
  {
    "id": "315c530e-a19d-4909-afdf-f56d800ac59e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/315c530e-a19d-4909-afdf-f56d800ac59e",
    "created_at": "Tue Feb 19 18:36:01 UTC 2019",
    "company": "Linkwell Health",
    "company_url": "https://linkwellhealth.com",
    "location": "New York",
    "title": "Senior Software Engineer",
    "description": "<p>Location: Offices in NYC with flexibility for remote work.</p>\n<p>Salary: Commensurate with experience</p>\n<p>Senior Software Engineer</p>\n<p>Role Summary</p>\n<p>Linkwell Health has an opportunity for a Senior Software Engineer to join our growing content marketing business. In this role you will build the tools, technology, and team that fuels content marketing for our partners.  At Linkwell Health we use technology to create, publish, measure, and optimize our award-winning content in an effort to create healthy experiences.</p>\n<p>Our ideal candidate is a skilled coder who will embrace the chance to make an impact on our technology, our business and our culture. You will have the opportunity to improve and change our product development processes.  You will have the opportunity to build and mentor a team of developers. You will have the opportunity to help millions of consumers get clear, engaging communications from their healthcare providers.</p>\n<p>Linkwell Health’s core technologies include Drupal, Google Analytics and Acquia.  You should understand web publishing, content management, web analytics, and social media. You should be comfortable working with internal resources and external partners to execute development projects.</p>\n<p>Key Objectives</p>\n<p>Objective 1: Deliver software that grows the business</p>\n<p>You will build products and features that deliver outstanding value to Linkwell’s clients and their members.</p>\n<p>Deliver stable, production ready code</p>\n<p>Strive to exceed client’s expectations</p>\n<p>Be transparent and open regarding timelines and obstacles</p>\n<p>Solve problems when possible, seek answers when necessary</p>\n<p>Take pride of ownership in all projects you touch; leave code better than you found it.</p>\n<p>Deliver code that’s easy to deploy, update and monitor by ensuring that the necessary tooling is present early in the project development cycle or by introducing tooling into an existing project, as needed</p>\n<p>Objective 2: Accelerate the growth of Linkwell’s core platform</p>\n<p>You will leverage your expertise and work with our partners so that we can deploy, test and learn faster.</p>\n<p>Increase the rate at which new features are added to the product.</p>\n<p>Assess the current development process and offer ideas for improvement</p>\n<p>Continually look for more efficient ways to operate</p>\n<p>Contribute to the product backlog by adding new ideas</p>\n<p>Help others on the team to improve/elevate their ideas</p>\n<p>Bring an entrepreneurial spirit and team-first attitude</p>\n<p>Objective 3: Build a team</p>\n<p>You will build a team that brings a unique and fresh technical perspective to the business challenges and opportunities we observe in the market today.</p>\n<p>Consistently identify “A Players” to be resources for the team</p>\n<p>Interview and hire developers</p>\n<p>Demonstrate the ability to effectively manage your a team</p>\n<p>Retain and grow technical talent</p>\n<p>Take the time to listen to feedback from the team and our clients</p>\n<p>Coordinate projects with other agency and contract partners</p>\n<p>Qualifications:</p>\n<ul>\n<li>\n<pre><code>  Excellent communication skills\n</code></pre>\n</li>\n<li>\n<pre><code>  Bachelor’s degree in IS, CS or related field\n</code></pre>\n</li>\n<li>\n<pre><code>  5 + Years professional experience as a developer\n</code></pre>\n</li>\n<li>\n<pre><code>  Experience working with Drupal, or an excited willingness to learn Drupal\n</code></pre>\n</li>\n<li>\n<pre><code>  Proven expertise developing content management systems and/or SaaS applications\n</code></pre>\n</li>\n<li>\n<pre><code>  Prior work in content marketing or publishing a plus\n</code></pre>\n</li>\n</ul>\n<p>ABOUT US:</p>\n<p>Linkwell Health is a content- and technology-driven company that creates digital content marketing solutions to help health plans and health services companies better engage and build trust with their audiences. We create, develop, and deliver best-in-class health and wellness content across video, web, email, mobile, social, and print. Our mission? To drive brand awareness, audience development, and digital engagement for our clients, while simultaneously creating healthy experiences for consumers.</p>\n<p>Our core capabilities are Content + Technology + Talent, and our unique expertise is moving the needle with consumers and helping them to do things to improve their health</p>\n",
    "how_to_apply": "<p>Please follow this link to apply for this role. <a href=\"https://bit.ly/2Ndym0G\">https://bit.ly/2Ndym0G</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUplIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ddd02a22e4b0474e0323a37e2036195d8d059e09/Linkwell%20Health.jpg"
  },
  {
    "id": "7f4c2a62-3ef1-4dbd-8c3f-6f05bf9b5240",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7f4c2a62-3ef1-4dbd-8c3f-6f05bf9b5240",
    "created_at": "Tue Feb 19 18:21:05 UTC 2019",
    "company": "TED Conferences",
    "company_url": null,
    "location": "Remote ",
    "title": "Backend Engineer",
    "description": "<p><strong>POSITION OVERVIEW</strong></p>\n<p>TED is a critically acclaimed, award-winning conference and website featuring inspiring talks from the world's leading thinkers and doers. Since 2006, TED Talks have been watched more than four billion times worldwide and drawn best-in-class sponsors and partnerships. We pride ourselves on combining intelligent, forward-thinking content with leading-edge technology and intuitive design. And we're hiring!</p>\n<p>We’re looking for an experienced Backend Engineer to work on the entire range of TED initiatives including TEDx, TED-Ed, TED Fellows, The Audacious Project, as well as the main TED.com site. The Backend Engineer is also responsible for a myriad of internal applications which, among many other things, power our video production pipeline, syndicate our video content to partners worldwide, and build a lasting archive of ideas.</p>\n<p>This is a remote position.</p>\n<p><strong>QUALIFICATIONS / SKILLS</strong></p>\n<ul>\n<li>Experience with developing APIs</li>\n<li>Works well in iterative development process</li>\n<li>Ability to take code from development all the way through to production</li>\n<li>Ability to test your code for bugs along the way</li>\n<li>Familiarity with application and data security best practices</li>\n<li>Familiarity with server side design patterns and architecture</li>\n<li>Ability to troubleshoot issues in a calm but fast manner</li>\n<li>Ability to balance negotiations between doing it right and doing it fast</li>\n<li>Ability to work individually, as well as collaborating with other developers</li>\n<li>Analytical mind and strong problem solving skills</li>\n<li>Self-starter who can manage own time and project workload</li>\n<li>Values cross-functional collaboration</li>\n<li>Values a diverse workplace</li>\n<li>Good communication skills</li>\n</ul>\n<p>These are some of the tools that we require a highly-qualified candidate to be familiar with.</p>\n<ul>\n<li>Ruby / Ruby on Rails</li>\n<li>MySql</li>\n<li>Git/Github</li>\n</ul>\n<p>Our team also works with the following tools, familiarity is desired:</p>\n<ul>\n<li>Node</li>\n<li>Nginx / Varnish</li>\n<li>ElasticSearch</li>\n<li>Logstash / Kibana / Graphite/ Ganglia</li>\n<li>Amazon Web Services</li>\n<li>Docker</li>\n</ul>\n<p><strong>RESPONSIBILITIES</strong></p>\n<ul>\n<li>Write clean and maintainable code that is well covered by tests and is documented</li>\n<li>Test your code for bugs along the way</li>\n<li>Manage the stability, reliability, and maintainability of back-end code for TED</li>\n<li>Develop, monitor, and maintain services that power our initiatives</li>\n<li>Willingness to contribute however possible to ensure overall effectiveness of position</li>\n<li>Other duties and special projects as may be assigned from time to time</li>\n</ul>\n<p><strong>WORKPLACE CONDITIONS</strong></p>\n<ul>\n<li>General: Office environment</li>\n<li>Physical: Repetitive movement of wrists, hands, and/or fingers</li>\n<li>Mental/Visual: Concentrated mental and/or visual attention; work involves performing tasks to very close accuracy and quality specifications</li>\n<li>Machines, Tools, Equipment, Electronic Devices, Computer Software, etc.:</li>\n<li>Ability to use common office equipment such as telephone, computer and copier</li>\n<li>Computer programs to include MS Office, Mac programs, Google Docs, functional related databases</li>\n<li>Travel: Upon request / as needed</li>\n</ul>\n<p><em>TED Conferences LLC is an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. We invite all qualified candidates to apply online with their resume.</em></p>\n",
    "how_to_apply": "<p>Visit job posting to apply: <a href=\"https://tedconferencesllc.applytojob.com/apply/xAckjN53fu/Backend-Engineer\">https://tedconferencesllc.applytojob.com/apply/xAckjN53fu/Backend-Engineer</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHBlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--41fb93dd4857a3af6a7fef5198a0e6831bcbe5e8/Ted%20Logo%20.png"
  },
  {
    "id": "4fc965c4-0e29-4839-b31c-3b37ed1c40d6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4fc965c4-0e29-4839-b31c-3b37ed1c40d6",
    "created_at": "Tue Feb 19 17:44:49 UTC 2019",
    "company": "Pangea Money Transfer",
    "company_url": null,
    "location": "Chicago, IL",
    "title": "iOS Developer",
    "description": "<p>ABOUT US</p>\n<p>Founded in 2012 and headquartered in Chicago, IL, Pangea started with the mission of making international money transfer simple, fair and safe. Since then, we have grown to offer additional products and services to help the underbanked have access and financial independence.</p>\n<p>As Pangeans, we value introspection, accountability, empowerment, excellence, and above all, kindness. We believe in a fierce dedication to customer experience. We know that diversity is the key to innovation and creativity. If you have a growth mindset and are creative, you’re a great fit for our team!</p>\n<p>ABOUT THE ROLE</p>\n<p>We are looking for software engineers to build and maintain new features for the Pangea platform that improve usability, prevent fraud, and create APIs and services that work with our partners to launch new markets, payment methods, and capabilities. Our platform includes a set of native iOS, Android and Web apps and a set of API microservices built using multiple languages, all hosted on AWS.</p>\n<p>If you have an entrepreneurial passion, are motivated by building successful products and learning new technologies and systems, then we want to talk to you!</p>\n<p>RESPONSIBILITIES</p>\n<p>Design and build features for the Pangea iOS app\nCollaborate with product team to review and refine requirements\nTranslate designs and wireframes into high-quality code\nCollaborate with team to define internal APIs used by the mobile app\nEnsure application quality, maintainability and performance\nIdentify and correct bottlenecks and fix bugs</p>\n<p>QUALIFICATIONS</p>\n<p>Bachelor's degree in computer science or related\n3+ years of experience in Swift or Objective C\nUnderstanding of Apple’s design principles and interface guidelines\nExperience using RESTful APIs to connect to back-end services\nExperience with common iOS frameworks</p>\n<p>Pangea is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p>\n",
    "how_to_apply": "<p><a href=\"https://hire.withgoogle.com/public/jobs/gopangeacom/view/P_AAAAAAFAAIGL-f0LGI5RYM?trackingTag=github\">https://hire.withgoogle.com/public/jobs/gopangeacom/view/P_AAAAAAFAAIGL-f0LGI5RYM?trackingTag=github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGhlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f8b53140d9314d9ff5cce1188ea8a4c7714fd42a/logo.png"
  },
  {
    "id": "0e908257-d3b1-4495-9492-0ae5d31105ee",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0e908257-d3b1-4495-9492-0ae5d31105ee",
    "created_at": "Tue Feb 19 17:43:17 UTC 2019",
    "company": "Pangea Money Transfer",
    "company_url": "https://pangeamoneytransfer.com/",
    "location": "Chicago, IL",
    "title": "Android Developer",
    "description": "<p>ABOUT US</p>\n<p>Founded in 2012 and headquartered in Chicago, IL, Pangea started with the mission of making international money transfer simple, fair and safe. Since then, we have grown to offer additional products and services to help the underbanked have access and financial independence.</p>\n<p>As Pangeans, we value introspection, accountability, empowerment, excellence, and above all, kindness. We believe in a fierce dedication to customer experience. We know that diversity is the key to innovation and creativity. If you have a growth mindset and are creative, you’re a great fit for our team!</p>\n<p>ABOUT THE ROLE</p>\n<p>We are looking for software engineers to build and maintain new features for the Pangea platform that improve usability, prevent fraud, and create APIs and services that work with our partners to launch new markets, payment methods, and capabilities. Our platform includes a set of native iOS, Android and Web apps and a set of API microservices built using multiple languages, all hosted on AWS.</p>\n<p>If you have an entrepreneurial passion, are motivated by building successful products and learning new technologies and systems, then we want to talk to you!</p>\n<p>RESPONSIBILITIES</p>\n<p>Design and build features for the Pangea Android app\nCollaborate with product team to review and refine requirements\nTranslate designs and wireframes into high-quality code\nCollaborate with team to define internal APIs used by the mobile app\nEnsure application quality, maintainability and performance\nIdentify and correct bottlenecks and fix bugs</p>\n<p>QUALIFICATIONS</p>\n<p>Bachelor's Degree in computer science or related\n3+ years of experience building Android apps using Java and/or Kotlin\nStrong knowledge of Android SDK and how to deal with Android variations\nStrong knowledge of Android UI design principles, patterns, and best practices\nExperience using RESTful APIs to connect to back-end services\nExperience with threading and performance tuning</p>\n<p>Pangea is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p>\n",
    "how_to_apply": "<p><a href=\"https://hire.withgoogle.com/public/jobs/gopangeacom/view/P_AAAAAAFAAIGDJyf725Y8g1?trackingTag=github\">https://hire.withgoogle.com/public/jobs/gopangeacom/view/P_AAAAAAFAAIGDJyf725Y8g1?trackingTag=github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGRlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--da24cd423d78a3d1fd72a101a91cc032baf405c3/logo.png"
  },
  {
    "id": "9874e35f-576f-49e6-8d7d-087d0568de3f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9874e35f-576f-49e6-8d7d-087d0568de3f",
    "created_at": "Tue Feb 19 16:01:26 UTC 2019",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "location": "Cupertino, CA",
    "title": "Siri - Data Engineer",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n<p>Job Summary:\nPlay a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large-scale systems, spoken language, big data, and artificial intelligence. And work with the people who built the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri team!</p>\n<p>Key Qualifications:</p>\n<ul>\n<li>Strong data analytical skills</li>\n<li>Excellent coding skills in one or more of following languages — Python, Shell scripts, java etc</li>\n<li>Experienced in big data processing, tools development and/or web crawling</li>\n<li>Outstanding communication skills</li>\n<li>Gradings tasks and tools preferred: e.g. for transcribing speech audio, labeling tasks, language translation, etc.</li>\n<li>Knowledge in the field of language technologies/NLP, such as language modeling, machine translation, text mining, parsing, etc.</li>\n<li>Multilingual speaker</li>\n</ul>\n<p>Description:\nWe are looking for highly motivated engineers to fulfill our data needs and drive the product quality to the next level. You will be working closely with a group of talented researchers and engineers on the groundbreaking machine learning technologies. Your responsibilities include data creation, data management, processing pipeline and tools development. The role also involves the collaborations with other multi-functional teams on data related projects.</p>\n<p>Education:\nBS or MS in Computer Science or equivalent experience</p>\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n<p>REQUISITION NUMBER: 200029178\nCOMPANY NAME: Apple Inc.</p>\n",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=85ecf6268a7bf1e332148c6cb483f406\">Apply here</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFJlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5229c19e88b8976f5d9b155252684ef848180b61/Apple_300x300.jpeg"
  },
  {
    "id": "e67a5e0c-feb0-4bf2-a279-13699606574b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e67a5e0c-feb0-4bf2-a279-13699606574b",
    "created_at": "Mon Feb 18 08:48:50 UTC 2019",
    "company": "OTTO (GmbH & Co KG)",
    "company_url": "https://www.otto.de/",
    "location": "Hamburg, Deutschland",
    "title": "Full Stack Developer (w/m/divers) Fokus Frontend | Inhouse Startup OTTO NOW",
    "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p><strong>Wir sind OTTO NOW</strong> – das neue Geschäftsmodell von OTTO: Wir vermieten Produkte, statt sie zu verkaufen. Gemeinsam entwickeln wir mit viel Engagement und hoher Gestaltungsfreiheit einen neuen Markt. Dabei verantworten wir alle Teile des Geschäftsmodells und der zugehörigen Prozesse, die auf unserer Microservice-Plattform aufbauen.</p>\n<p>In unserem aktuell <a href=\"https://www.ottonow.de/team\">16-köpfigen Team</a> vereinen wir zu gleichen Teilen die fachlichen und technischen Kompetenzen zur Weiterentwicklung von OTTO NOW. Von der Roadmap über die Epics bis zur einzelnen Story arbeiten bei uns Entwickler, Fachexperten und Product Owner eng zusammen.</p>\n<p>Als Inhouse Startup mit eigener Plattform erzielen wir schnelle Fortschritte. Um dabei den Überblick zu behalten, kombinieren wir die Vorzüge von Scrum und Kanban und passen diese fortlaufend an unser wachsendes Team an.</p>\n<p>﷟HYPERLINK \"<a href=\"https://stackshare.io/otto-now/otto-now\">https://stackshare.io/otto-now/otto-now</a>\" Unseren <strong>Tech Stack</strong> (u.a. Kotlin, React und Typescript) findest du <a href=\"https://stackshare.io/otto-now/otto-now\">HIER</a>!</p>\n<p><strong>Das bringt der Job</strong>:\n-Dein Schwerpunkt liegt auf der Weiterentwicklung unserer Frontends für unsere Kunden, unsere Kundenberatung und unser Team.\n-Gleichzeitig unterstützt du bei der Weiterentwicklung im Backend und dem Betrieb unserer Systeme mit verteilter Architektur (Microservices).\n-In unserem Daily berichtest du, was du am Tag zuvor durch unsere vollautomatisierte Deployment Pipeline in die Cloud gepusht hast.\n-Zusätzlich zu Konzeption, Umsetzung, Testing, QA bis zum Betrieb deiner entwickelten Software gestaltest du unsere Teamkultur und Zusammenarbeit in unseren Retros (und bei spontanen Playstation-Sessions) mit.</p>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Soeren.Nilsson@otto.de\">Soeren.Nilsson@otto.de</a>  aus dem OTTO NOW-Team oder triff uns und unsere OTTO-Kollegen <a href=\"https://www.otto.de/unternehmen/jobs/events/\">hier</a>.</p>\n<p><strong>Das brauchen wir</strong>:\n<strong>Must-have</strong>: Javascript-SPA-Frameworks (z.B. React, Angular, Vue); Typescript; Webpack; SASS.</p>\n<p><strong>Nice-to-have</strong>: Erfahrung in verteilter Architektur (z.B. Microservices); Erfahrung in crossfunktionaler Teamzusammenarbeit und agilen Entwicklungsmethoden (Scrum, Kanban); Bootstrap; Amazon AWS; Erfahrung mit JVM-Sprachen (bspw. Kotlin, Java, Groovy); Docker; PostgreSQL; Betrieb von ECS oder Kubernetes; Kafka; Spring-Boot; Terraform; ElasticSearch.</p>\n<p><strong>Das bieten wir</strong>:</p>\n<p>-Entwicklungsumgebung, OS und gelegentlich Home-Office statt Büro – du hast die Wahl!\n-Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche -Entwicklung betrifft – wir unterstützen dich dabei!\n-Komm mit uns auf (internationale) Fachkonferenzen wie code.talks, GOTO Berlin, JAX, DEVOXX, interne Fachevents, Hackathons und Tech Talks/Meetups wie Develop\n-<a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/\">Innovative Arbeitswelten</a> , flexible Arbeitszeiten (37,5-Stunden-Woche, Gleitzeit), Homeoffice- und Sabbatical-Möglichkeiten\n-Und wir bieten <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">noch mehr</a>!</p>\n",
    "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnhlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2fabb17231a3c973e33a2bbc59afb79aae1c1abb/Otto_Logo_300dpi_jpg.jpg"
  },
  {
    "id": "3299b71e-0c21-4bec-9c04-0d74c9db6331",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3299b71e-0c21-4bec-9c04-0d74c9db6331",
    "created_at": "Mon Feb 18 08:58:54 UTC 2019",
    "company": "OTTO (GmbH & Co KG)",
    "company_url": "https://www.otto.de/",
    "location": "Hamburg, Deutschland",
    "title": "Full Stack Developer (w/m/divers) Fokus Frontend | Inhouse Startup OTTO NOW ",
    "description": "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform otto.de. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!</p>\n<p><strong>Wir sind OTTO NOW</strong> – das neue Geschäftsmodell von OTTO: Wir vermieten Produkte, statt sie zu verkaufen. Gemeinsam entwickeln wir mit viel Engagement und hoher Gestaltungsfreiheit einen neuen Markt. Dabei verantworten wir alle Teile des Geschäftsmodells und der zugehörigen Prozesse, die auf unserer Microservice-Plattform aufbauen.</p>\n<p>In unserem aktuell <a href=\"https://www.ottonow.de/team\">16-köpfigen Team</a> vereinen wir zu gleichen Teilen die fachlichen und technischen Kompetenzen zur Weiterentwicklung von OTTO NOW. Von der Roadmap über die Epics bis zur einzelnen Story arbeiten bei uns Entwickler, Fachexperten und Product Owner eng zusammen.</p>\n<p>Als Inhouse Startup mit eigener Plattform erzielen wir schnelle Fortschritte. Um dabei den Überblick zu behalten, kombinieren wir die Vorzüge von Scrum und Kanban und passen diese fortlaufend an unser wachsendes Team an.</p>\n<p>﷟HYPERLINK \"<a href=\"https://stackshare.io/otto-now/otto-now\">https://stackshare.io/otto-now/otto-now</a>\" Unseren <strong>Tech Stack</strong> (u.a. Kotlin, React und Typescript) findest du <a href=\"https://stackshare.io/otto-now/otto-now\">HIER</a>!</p>\n<p><strong>Das bringt der Job</strong>:\n-Dein Schwerpunkt liegt auf der Weiterentwicklung unserer Frontends für unsere Kunden, unsere Kundenberatung und unser Team.\n-Gleichzeitig unterstützt du bei der Weiterentwicklung im Backend und dem Betrieb unserer Systeme mit verteilter Architektur (Microservices).\n-In unserem Daily berichtest du, was du am Tag zuvor durch unsere vollautomatisierte Deployment Pipeline in die Cloud gepusht hast.\n-Zusätzlich zu Konzeption, Umsetzung, Testing, QA bis zum Betrieb deiner entwickelten Software gestaltest du unsere Teamkultur und Zusammenarbeit in unseren Retros (und bei spontanen Playstation-Sessions) mit.</p>\n<p>Hast du weitere Fragen? – Dann wende dich an <a href=\"mailto:Soeren.Nilsson@otto.de\">Soeren.Nilsson@otto.de</a>  aus dem OTTO NOW-Team oder triff uns und unsere OTTO-Kollegen <a href=\"https://www.otto.de/unternehmen/jobs/events/\">hier</a>.</p>\n<p><strong>Das brauchen wir</strong>:</p>\n<p><strong>Must-have</strong>: Javascript-SPA-Frameworks (z.B. React, Angular, Vue); Typescript; Webpack; SASS.</p>\n<p><strong>Nice-to-have</strong>: Erfahrung in verteilter Architektur (z.B. Microservices); Erfahrung in crossfunktionaler Teamzusammenarbeit und agilen Entwicklungsmethoden (Scrum, Kanban); Bootstrap; Amazon AWS; Erfahrung mit JVM-Sprachen (bspw. Kotlin, Java, Groovy); Docker; PostgreSQL; Betrieb von ECS oder Kubernetes; Kafka; Spring-Boot; Terraform; ElasticSearch.</p>\n<p><strong>Das bieten wir</strong>:</p>\n<p>-Entwicklungsumgebung, OS und gelegentlich Home-Office statt Büro – du hast die Wahl!\n-Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche -Entwicklung betrifft – wir unterstützen dich dabei!\n-Komm mit uns auf (internationale) Fachkonferenzen wie code.talks, GOTO Berlin, JAX, DEVOXX, interne Fachevents, Hackathons und Tech Talks/Meetups wie Develop\n-<a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/\">Innovative Arbeitswelten</a> , flexible Arbeitszeiten (37,5-Stunden-Woche, Gleitzeit), Homeoffice- und Sabbatical-Möglichkeiten\n-Und wir bieten <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\">noch mehr</a>!</p>\n",
    "how_to_apply": "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\">https://www.otto.de/unternehmen/de/datenschutz.php</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjFlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--88e15377a539ffd609fc55f485d18cf0386710ed/Otto_Logo_300dpi_jpg.jpg"
  },
  {
    "id": "f8a0974c-8b3a-4036-8d42-63b5ed5c6486",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f8a0974c-8b3a-4036-8d42-63b5ed5c6486",
    "created_at": "Tue Feb 19 14:38:36 UTC 2019",
    "company": "Cobiro ",
    "company_url": "https://cobiro.com/",
    "location": "Copenhagen",
    "title": "Principal Engineer",
    "description": "<p><strong>Be a part of an exciting journey</strong></p>\n<p>At Cobiro we're using machine learning and AI to build the next generation of online advertising experiences. We're on a mission to make online marketing accessible, trivial and high-performing for everyone, and we're starting with Google Ads.</p>\n<p>Working at Cobiro, you’ll join a flat and agile organisation where bright ideas are appreciated and implemented regardless of seniority or area of specialization. We’re ambitious and work hard, but also know how to let loose and celebrate our accomplishments. At Cobiro you will meet different nationalities and personalities. We have common denominators: We are self-starters and team-players, love to solve problems, and we create high quality solutions.</p>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>Flexible working hours</li>\n<li>An agile work environment</li>\n<li>Focus on quality solutions</li>\n<li>Options to attend relevant courses and conferences</li>\n<li>A team of passionate, skilled and experienced colleagues</li>\n<li>All the gear and food you need: breakfast on Fridays, lunch every day, sodas, sparkling water, fruit, vegetables, sweets...</li>\n<li>Frequent social company activities, Friday bar included</li>\n<li>Good working equipment</li>\n<li>A great working location at Esplanaden, Central Copenhagen</li>\n</ul>\n<p><strong>Principal Engineer</strong></p>\n<ul>\n<li>You will join a company where quality is valued; you will be given the chance to be responsible for the development and implementation of technical and organisational road maps, providing guidance and oversight to see these plans through to completion.</li>\n<li>Given your experience you provide an architectural overview over the platform and technical vision, developing, maintaining and modifying existing systems when required.</li>\n<li>You will participate in project analysis, design, implementations and commissioning phases; reviewing existing system designs and recommending improvements is a natural part of the job. With your experience in analyzing project requirements you will be providing technical and functional recommendations accordingly.</li>\n<li>You keep yourself updated and are aware of the latest developments in relevant technologies to help improve performance and customer satisfaction.</li>\n<li>You are a good communicator and  act as  the link between strategy and tactics, looking at business goals and translating them into projects.</li>\n</ul>\n<p>You will be joining a skilled tech team, we practice daily stand-ups, 14 day sprints, and work within smaller teams. We can offer an agile working environment: we collaborate across departments as well, for example AI, QA, Frontend, Backend, or Product Management.</p>\n<p><strong>For this position, you will need:</strong></p>\n<ul>\n<li>Experience building and maturing an international software as a service platform, ideally in a startup environment</li>\n<li>A background as a developer on Unix/Linux, ideally with knowledge of PHP/Laravel and/or Typescript/Angular</li>\n<li>Experience with Amazon Web Services (AWS)</li>\n<li>Hands-on experience with Machine Learning and Natural Language Processing (Cobiro has an AI team of 6)</li>\n</ul>\n",
    "how_to_apply": "<p>We are looking forward to receiving your application through our application system - simply click on the link below and attach your CV and/or Linkedin account.</p>\n<p><a href=\"https://cobiro.bamboohr.co.uk/jobs/view.php?id=50\">https://cobiro.bamboohr.co.uk/jobs/view.php?id=50</a></p>\n<p>You will always get a reply when applying through our system.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEplIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ce342fd63aa6d1ac848019c372cf172993a383b8/Cobiro%20Logo.png"
  },
  {
    "id": "ea893c2a-4c8b-46d8-b82e-f038832e17bb",
    "type": "Part Time",
    "url": "https://jobs.github.com/positions/ea893c2a-4c8b-46d8-b82e-f038832e17bb",
    "created_at": "Tue Feb 19 00:07:23 UTC 2019",
    "company": "iBH Media Group",
    "company_url": "http:",
    "location": "Houston",
    "title": "Django Developer / VOD OTT",
    "description": "<p><em><strong>CANDIDATE MUST RESIDE IN HOUSTON</strong></em></p>\n<p>iBH Tv is a start up Live Streaming VOD / OTT channel with a focus on Live Content and pre produced programming on demand. We have an initial website in WP and require a dashboard and the site re-built in Django or GitHub to transition into AWS. Experience with Roku, Fire stick, YouTube applications VOD, OTT, Streaming Video, php, js, Laravel and more.\niBH Tv is a startup company and this position will be contract /part time at first with an opportunity to participate in equity sharing after we launch and becoming full-time. If you're looking for a challenging project, let's talk.</p>\n<p><em><strong>CANDIDATE MUST RESIDE IN HOUSTON</strong></em></p>\n",
    "how_to_apply": "<p><a href=\"mailto:info@ibhmedia.com\">info@ibhmedia.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczFlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--099de0e7f6738b9e846ab95dd8452ed82ba119b6/ibh-tv%20(Slim%20Profile%20Signature).jpg"
  },
  {
    "id": "6486e9c7-80df-4876-9b27-aabb70d4d5d9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6486e9c7-80df-4876-9b27-aabb70d4d5d9",
    "created_at": "Mon Feb 18 16:51:22 UTC 2019",
    "company": "UMI - Urban Mobility International",
    "company_url": "https://www.urban-mobility.io/",
    "location": "Berlin",
    "title": "(Senior) Solution Architect (m/f/d)",
    "description": "<p>We drive the future of mobility. With the backing and support of the Volkswagen AG, we will develop innovative, sustainable solutions that will make movement in urban spaces more flexible and more comfortable. Our customer-centric approach means that to us, mobility is not just a means to an end. It’s a passion. We are UMI.</p>\n<p><strong>YOUR UPCOMING PROJECTS</strong></p>\n<ul>\n<li>Plan, design, implement and execute complex mobility solutions from configuration and testing to support of the developed solutions</li>\n<li>Operate in a fast-paced environment where you will be responsible for driving the right decisions and qualifying specific opportunities technically</li>\n<li>Responsible for ongoing recommendations and best practices for storage solutions around business continuity, high availability, backup, recovery and archiving</li>\n<li>Manage the integration of connected hardware, service backend and customer frontend successfully</li>\n<li>Hold full responsibility for the functionality of our mobility services and the links between all components</li>\n<li>Defining and identifying IT projects in the coming quarters by acting as a trusted advisor to different stakeholders (such as Product, Engineering, Management)</li>\n</ul>\n<p><strong>YOUR BACKGROUND</strong></p>\n<ul>\n<li>You have successfully realized a mobile mobility service (or similar) from a technical perspective</li>\n<li>You have great technical understanding of new-mobility related mechatronics, electronics and software architecture, especially API management and the interaction between hardware and software</li>\n<li>You are familiar with micro services and event-driven serverless computing</li>\n<li>You are able to document our architecture by using UML as a standard</li>\n<li>You are able to review and analyse our code and create proof of concepts for different ideas within the engineering team (e.g. new technologies, new ways of scaling our services)</li>\n<li>You follow architectural principles and adapt them to our way of working</li>\n<li>You have successfully built and enabled teams and will support the team with your hands-on experience</li>\n<li>You know your way around the tech start-up work environment</li>\n<li>You’re passionate about the future of mobility and current technology trends in the sphere</li>\n<li>You put the customer first in everything you do</li>\n<li>Your English is fluent, your stakeholder management is excellent and your ability to prioritize is outstanding</li>\n</ul>\n<p><strong>YOUR BENEFITS</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>30 vacation days</li>\n<li>Mobility budget</li>\n<li>Flexible working hours</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/8b3e309d62e4de22f112017d9770d3df433929f7/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f633f6369643d36363263393430372d663863622d343032342d613136392d393063316334356463666234266a69643d61346566323339652d633730302d343763362d616135652d353238333335313362613365267069643d65653833393965332d656566322d346535372d386634362d3136373730363531616265652665633d76696577253341706978656c2663623d687474707325334125324625324673332d65752d776573742d312e616d617a6f6e6177732e636f6d253246676f686972696e672d7075626c69632d617373657473253246706978656c2e676966\"></p>\n",
    "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=a4ef239e-c700-47c6-aa5e-52833513ba3e&amp;pid=ee8399e3-eef2-4e57-8f46-16770651abee&amp;ec=click%3Aapply_url&amp;cb=https%3A%2F%2Furban-mobility-international-gmbh-jobs.personio.de%2Fjob%2F84998%23apply\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3RlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f4a98ec2c4c753ebb53dfb7b267b190314d6c1ef/UMI-Logo.png"
  },
  {
    "id": "07642d87-19fa-4786-b2d0-cf87da8dcb3a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/07642d87-19fa-4786-b2d0-cf87da8dcb3a",
    "created_at": "Mon Feb 18 15:57:38 UTC 2019",
    "company": "Threadless",
    "company_url": null,
    "location": "Chicago, IL, US",
    "title": "Senior Software Engineer - Python Django and Flask",
    "description": "<p>Senior Software Engineer - Python Django and Flask\nAbout Us:</p>\n<p>Threadless is made up of creatives from all over the world who come together to make great art.</p>\n<p>We started with just tees, but tons of products make great canvases. While we work with partners to find these canvases for our artists, it’s our community who makes and picks the best art for us to offer. Whether it’s voted-on art at Threadless.com or designs artists choose to include on their very own Artist Shops, when you buy from us, you support great art. The weird art. The geeky art. The beautiful art.</p>\n<p>Threadless. Make Great Together</p>\n<p>About This Role:</p>\n<p>The Threadless Digital team is building the world's best platforms for artists to share and sell their art. We are growing and adding an additional senior software engineer to our seven-person team. We work in an open and casual office that's in the center of Chicago's thriving West Loop neighborhood.</p>\n<p>Threadless is a Python shop. We're using Django with Threadless.com and for our Artist Shops platform. Our API is built on top of the Flask framework. To handle our asynchronous work, we have a distributed task queue system which has been built with Celery. We're an agile team that's focused on enhancing Threadless.com and our growing Artist Shops platform. Our technology helps hundreds of thousands of artists create and sell amazing products to millions of people.</p>\n<p>If you're interested in coding, solving problems, collaborating, learning, and building kick ass products then we'd love to hear from you.</p>\n<p>Education:</p>\n<p>BS in Computer Science, related degree, or equivalent experience</p>\n<p>Requirements:</p>\n<p>·         5+ years experience developing large web applications</p>\n<p>·         Expertise with Python, Django and Flask frameworks preferred</p>\n<p>·         Experience writing scalable and efficient code for large production web applications</p>\n<p>Bonus Points For:</p>\n<p>·         Full stack engineering: front end and back end experience</p>\n<p>·         Excellent Git-fu</p>\n<p>·         Django wizardry: Adding features to large production Django applications and upgrading Django versions.</p>\n<p>·         Working with Amazon Web Services, or other cloud hosting services</p>\n<p>·         Experience optimizing the performance of web applications</p>\n<p>·         Hands on experience with MySQL: migrations, optimizations, and performance tuning</p>\n<p>·         Elasticsearch server deployments and writing Elasticsearch queries</p>\n<p>·         Quality contributions to open source projects</p>\n<p>·         Hands-on experience refactoring production code</p>\n<p>·         Love of software engineering practices like: test driven development, continuous integration, pair programming, and code reviews</p>\n<p>·         Examples of launched projects</p>\n<p>Perks:</p>\n<p>·      Full benefits package and matching 401k plan</p>\n<p>·      Unlimited vacation policy and flexible schedules, including the ability to work remotely</p>\n<p>·      Paid Maternity and Paternity Leave</p>\n<p>·      Access to conferences and continued education</p>\n<p>·      Tons of free Threadless merchandise</p>\n<p>·      Work in a casual environment with talented, innovative people</p>\n<p>·      Canine co-workers, table tennis, foosball, bottomless LaCroix, endless snacks and catered breakfasts</p>\n<p>·      Fitness program reimbursements</p>\n<p>·      Mass transit benefits</p>\n",
    "how_to_apply": "<p><a href=\"https://jsco.re/2exx7\">https://jsco.re/2exx7</a></p>\n",
    "company_logo": null
  },
  {
    "id": "4d4de85e-ca76-436c-869a-6904ceda0b77",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4d4de85e-ca76-436c-869a-6904ceda0b77",
    "created_at": "Mon Feb 18 15:13:01 UTC 2019",
    "company": "Plotwise",
    "company_url": "http://www.plotwise.com",
    "location": "Delft",
    "title": "Lead DevOps Engineer",
    "description": "<p><strong>Lead DevOps Engineer</strong></p>\n<p><strong>Job description</strong></p>\n<p>Plotwise is a Planning Service Provider and shapes the new standard for distribution planning. By using our API, our pick-up and delivery customers are able to dynamically plan their distribution of goods in the most efficient way possible. To make it very simple, we help them deal with the increasing amount of online orders and demanding customers who want their purchases delivered within a day, at a specific time slot and location...and even change it last minute.  Currently our customers are mostly situated in the Benelux and are expanding rapidly across the world. A solid implementation is key to provide an excellent customer service to our clients. We therefore are urgently seeking for a:</p>\n<p><strong>Lead DevOps Engineer</strong></p>\n<p>‘You keep our systems secure, easy to manage and running 24/7' </p>\n<p><strong>Job profile</strong></p>\n<p>As our Lead DevOps Engineer you are responsible for ensuring that our systems are running 24/7, are secured and easy to manage. You are an expert in secure network infrastructures and Microservices Orchestration with proven managerial experience. In this role you will work closely together with the Development team, Deployment team and other related functions to ensure new or upgraded services. You will join the OPS team and manage several team members. You will report directly to our Technical Lead.</p>\n<p><strong>Responsibilities</strong></p>\n<p>As our Lead DevOps Engineer you will:</p>\n<ul>\n<li>Build and lead our OPS team.</li>\n<li>Interact and gather requirements form our Product Managers and Delivery Managers.</li>\n<li>Coordinate the deployment of new/ upgraded services together with our developers.</li>\n<li>Devise and architect secure infrastructures (networks and domains) and document the processes involved.</li>\n<li>Communicate with and/or instruct engineers within our managed hosting/ data centre partner.</li>\n<li>Improve the monitoring of running services.</li>\n<li>Troubleshoot failures.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><em>Qualifications</em>\nIn order to be successful you have:</p>\n<ul>\n<li>7+ years of working experience as a Lead DevOps Engineer in a complex environment.</li>\n<li>Experience with Microservices Orchestration (Docker + Kubernetes), Cloud Operations and Saltstack.</li>\n<li>You know Linux systems inside and out.</li>\n<li>Experience with configurations management tools such as Comsol.</li>\n<li>Knowledge of Python based application stacks (in docker) is a bonus.</li>\n<li>Proven managerial experience.</li>\n<li>Knowledge of network architectures/topologies and system security.</li>\n<li>Excellent communication skills both verbal and in writing (Dutch and English).</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>The opportunity to mature our OPS team and optimise our network and infrastructure.</li>\n<li>A competitive salary.</li>\n<li>An inspiring office in Delft (nearby the city centre).</li>\n<li>An international team with highly skilled (tech)professionals.</li>\n<li>Weekly and monthly team meetings.</li>\n<li>Daily healthy lunch and fresh coffee.</li>\n<li>Office massage and Yoga classes.</li>\n<li>Lots of social events such as quarterly team building activities and Friday drinks.</li>\n</ul>\n<p><strong>Interested?</strong></p>\n<p>Apply via the <a href=\"https://ltpx.nl/6mor1Oa\"><strong>application form</strong></a>.</p>\n<p><em>We are only interested in individual applications, recruitment agencies need not contact us concerning this vacancy.</em><img src=\"https://camo.githubusercontent.com/c1580cb5095450532d9512f1c1d672d8dd87aef0/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d3831343935\"></p>\n",
    "how_to_apply": "<p><a href=\"https://ltpx.nl/ybkXfkS\">Click here to apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2hlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8335a9e2bb24181634e0514972d2c9f05ed4356e/download.png"
  },
  {
    "id": "03507fc5-de67-41dc-af3e-617f4bfe1c60",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/03507fc5-de67-41dc-af3e-617f4bfe1c60",
    "created_at": "Mon Feb 18 12:27:16 UTC 2019",
    "company": "Sticker Mule",
    "company_url": "https://www.stickermule.com/careers",
    "location": "Remote",
    "title": "Sr. front end developer",
    "description": "<p>We created Sticker Mule to be the best place to work and shop. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work.</p>\n<p>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation.</p>\n<p><a href=\"https://www.stickermule.com/about\">Watch a brief video to learn more</a></p>\n<p><strong>Why we enjoy working here</strong></p>\n<ol>\n<li>We work flexible hours with an asynchronous culture. </li>\n<li>We work at a sustainable pace without unreasonable external deadlines.</li>\n<li>Varied, interesting technical challenges to work on.</li>\n<li>Opportunities to make a large impact as part of a small, highly motivated team.</li>\n</ol>\n<p><strong>Our tech stack</strong></p>\n<ol>\n<li>Backend: Ruby on Rails, NodeJS, Go</li>\n<li>DB: Postgres, MySQL, Redis</li>\n<li>Frontend:  React, Redux, Webpack</li>\n<li>APIS: GraphQL, GRPC, GCloud PubSub</li>\n<li>Google Cloud Platform</li>\n<li>Docker, Kubernetes</li>\n</ol>\n<p><strong>What you will do</strong></p>\n<ol>\n<li>Design, build, test and maintain single page applications and front-end features</li>\n<li>Look for ways to improve the performance and user experience of our site</li>\n<li>Write clean, performant code in accordance with our team’s code style guidelines</li>\n<li>Work to improve and maintain the health of our front end code</li>\n<li>Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way</li>\n<li>Participate in peer code reviews, share expertise with other members of the team and mentor junior developers</li>\n</ol>\n<p><strong>About you</strong></p>\n<ol>\n<li>You have a minimum of 3 years professional software development experience</li>\n<li>You’re passionate about front end</li>\n<li>You’re highly competent in JavaScript with a strong understanding of both the language fundamentals and browser APIs</li>\n<li>You're experienced in building single page applications with React or similar libraries</li>\n<li>You possess strong analytical and critical thinking skills</li>\n<li>You have great written and verbal communication skills in English</li>\n</ol>\n<p><strong>Requirements</strong></p>\n<ol>\n<li>Applicants will be sent a Hackerrank test within 1-3 days of applying.</li>\n<li>Test must be completed within 5 days.</li>\n</ol>\n<p><strong>Compensation</strong></p>\n<ol>\n<li>$90,000-$115,000+ depending on experience</li>\n<li>Signing bonus</li>\n<li>28 days vacation</li>\n</ol>\n",
    "how_to_apply": "<p>Apply here only:\n<a href=\"https://www.stickermule.com/career/36088186-191e-4471-b730-c939788adcce\">https://www.stickermule.com/career/36088186-191e-4471-b730-c939788adcce</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjllIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--20bbc815156bb11bcbbdd0ae9c53e82002da663a/01-sticker-mule-logo-dark-stacked.png"
  },
  {
    "id": "de930ba0-4f10-46ab-be18-17cfe7e26f47",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/de930ba0-4f10-46ab-be18-17cfe7e26f47",
    "created_at": "Fri Jan 18 09:54:10 UTC 2019",
    "company": "Sticker Mule",
    "company_url": "https://www.stickermule.com/careers",
    "location": "Remote",
    "title": "Sr. full-stack software engineer - JS + Ruby",
    "description": "<p>We created Sticker Mule to be the best place to work and shop. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work.</p>\n<p>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation.</p>\n<p><a href=\"https://www.stickermule.com/about\">Watch a brief video to learn more</a></p>\n<p><strong>Why we enjoy working here</strong></p>\n<ol>\n<li>We work flexible hours with an asynchronous culture. </li>\n<li>We work at a sustainable pace without unreasonable external deadlines.</li>\n<li>Varied, interesting technical challenges to work on.</li>\n<li>Opportunities to make a large impact as part of a small, highly motivated team.</li>\n</ol>\n<p><strong>Our tech stack</strong></p>\n<ol>\n<li>Backend: Ruby on Rails, NodeJS, Go</li>\n<li>DB: Postgres, MySQL, Redis</li>\n<li>Frontend:  React, Redux, Webpack</li>\n<li>APIS: GraphQL, GRPC, GCloud PubSub</li>\n<li>Google Cloud Platform</li>\n<li>Docker, Kubernetes</li>\n</ol>\n<p><strong>What you will do</strong></p>\n<ol>\n<li>Design, build, test, deploy and maintain web applications and services</li>\n<li>Write clean, performant code in accordance with our team’s code style guide</li>\n<li>Work to improve and maintain the code health of all our software</li>\n<li>Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way</li>\n<li>Participate in peer code reviews, share expertise with other members of the team, mentor junior developers</li>\n</ol>\n<p><strong>About you</strong></p>\n<ol>\n<li>You have a minimum of 3 years professional software development experience</li>\n<li>You’re highly competent in JavaScript and have some experience with Ruby</li>\n<li>You have experience building single page applications, ideally with React</li>\n<li>You possess strong analytical and critical thinking skills</li>\n<li>You have great written and verbal communication skills in English</li>\n</ol>\n<p><strong>Requirements</strong></p>\n<ol>\n<li>Applicants will be sent a Hackerrank test within 1-3 days of applying.</li>\n<li>Test must be completed within 5 days.</li>\n</ol>\n<p><strong>Compensation</strong></p>\n<ol>\n<li>$90,000-$115,000+ depending on experience</li>\n<li>Signing bonus</li>\n<li>28 days vacation</li>\n</ol>\n",
    "how_to_apply": "<p>Apply here only:\n<a href=\"https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf\">https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0pjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6d2fb3226ee8f4c00f92f2b69bdd86bdf5d884a6/01-sticker-mule-logo-dark-stacked.png"
  },
  {
    "id": "995b3fe4-1dbc-43e0-a97d-fcae0b9474f0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/995b3fe4-1dbc-43e0-a97d-fcae0b9474f0",
    "created_at": "Fri Feb 15 22:32:37 UTC 2019",
    "company": "Fictiv",
    "company_url": "http:",
    "location": "San Francisco, CA",
    "title": "Software Engineer",
    "description": "<p>We support a community that includes some of the most talented people on the planet.  You’ll design for hardware engineers who are literally building the future today (think autonomous vehicles, spaceships, next-gen medical devices). You’ll partner with some of the most skilled manufacturers who produce the seemingly impossible. You’ll collaborate with an amazing team of engineers, scientists, and artists who are passionate about democratizing hardware development.</p>\n<p>For decades, these innovators have had to endure long feedback cycles and high upfront costs to bring their products to market.  Our system drastically reduces that time and cost, allowing hardware engineers to experiment faster and with better outcomes.  As a Software Engineer, you will play a critical role in shaping this system to become the de facto standard platform for hardware development.</p>\n<p><strong>What’s in it for you?</strong></p>\n<p><em>Small team, big impact</em></p>\n<p>Our team is small and agile; as a core member, we will look to you for opinions and contributions that shape our engineering direction, product development practices, team culture, and Fictiv organization as a whole.</p>\n<p><em>Inspiring customers</em></p>\n<p>Our customers work on products that push technological boundaries – from self-driving cars to low-cost water purification systems. They inspire us to develop systems to move faster, build a higher quality product, and shape the future of manufacturing.</p>\n<p><em>Change an industry</em></p>\n<p>We have a big vision for what manufacturing should be, and we are determined to make that vision real. You’ll be working with smart, mission-driven teammates to create significant change in the industry.</p>\n<p><strong>What You'll Be Doing</strong></p>\n<ul>\n<li>Work with a cross-functional team to design and build an incredible software experience that our customers love</li>\n<li>Develop a highly reliable, distributed, easily updatable system that can be configured to customer needs</li>\n<li>Improve product development process to achieve high tempo and high reliability.</li>\n</ul>\n<p><strong>Desired Traits</strong></p>\n<ul>\n<li>You enjoy rapid software development, and can quickly build well-design, maintainable, and bug free features</li>\n<li>You’re a learner, you love getting feedback on design patterns and better approaches to building great software</li>\n<li>Willing to work outside of your comfort zone in any part of the software stack, and excited to dive deep in new areas as the needs of the business change</li>\n<li>You have an interest in how manufacturing works and the needs of our builders and manufacturing partners</li>\n<li>You love solving real world problems and getting positive (or constructive) feedback from customers</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/fictiv\">https://jobs.lever.co/fictiv</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmhlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ddfeaca545e56abd10ffcc46912311bf331b1207/Fictiv%20Logo%20Green.png"
  },
  {
    "id": "1f95b3fc-103e-4d9c-a0ea-bf741b3ffcdc",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/1f95b3fc-103e-4d9c-a0ea-bf741b3ffcdc",
    "created_at": "Fri Feb 15 22:23:09 UTC 2019",
    "company": "Fictiv",
    "company_url": "http://www.fictiv.com",
    "location": "San Francisco",
    "title": "Cloud Infrastructure Engineer",
    "description": "<p>Our software platform is at the core of what we do at Fictiv. Through software, we are building the future of manufacturing―supporting engineers, designers, and fabricators in some of the most cutting-edge industries on the planet. Our customers design and build things like autonomous cars, spaceships, and surgical robots.</p>\n<p>As a Cloud Infrastructure Engineer, you are the foundational support for our platform.  Not only do you operationalize and support the systems which run our Platform, but you anticipate and architect these systems for cost and scale.</p>\n<p><strong>What’s in it for you?</strong></p>\n<p><em>Small team, big impact</em></p>\n<p>Our team is small; as a core member, you will be building not just foundational systems, but also establishing best practices alongside our development team. As a platform built on trust and speed, your role is critical to improving efficiency, automation, and security.</p>\n<p><em>Inspiring customers</em></p>\n<p>Our customers work on products that push technological boundaries – from self-driving cars to low-cost water purification systems. They inspire us to develop systems to move faster, build higher quality product, and shape the future of manufacturing.</p>\n<p><em>Change an industry</em></p>\n<p>We have a big vision for what manufacturing should be, and we are determined to make that vision real. You’ll be working with smart, mission-driven teammates to create significant change in this industry.</p>\n<p><strong>What you’ll be doing</strong></p>\n<ul>\n<li>Leveraging automation to scale Fictiv’s infrastructure as we grow into a multi-regional global company</li>\n<li>Bring best practices to the team around incident management, traceability, observability, and system security</li>\n<li>Evaluating and implementing tools to improve efficiency, reliability, and security</li>\n<li>Reviewing architecture and designs to improve operational visibility and maintainability</li>\n</ul>\n<p><strong>Desired Traits</strong></p>\n<ul>\n<li>Experienced engineer with the ability to be hands-on, both in building infrastructure and debugging systems. Comfortable with designing and scaling event-driven systems</li>\n<li>Engages with colleagues to promote best practices on reliability, incident response, and security.\nUnderstands how to enact changes through influence as well as authority</li>\n<li>Available for shared on-call responsibility with other engineers (including developers) to meet SLA requirements for uptime</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/fictiv/08ba7674-259f-4bb4-b613-73b0ec42e245/apply\">https://jobs.lever.co/fictiv/08ba7674-259f-4bb4-b613-73b0ec42e245/apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBck5lIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--544ad3b048c24bd92107c412aa42735be8f408ed/Fictiv%20Logo%20Green.png"
  },
  {
    "id": "494c47b9-4d5f-45fc-952c-d08dd233114e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/494c47b9-4d5f-45fc-952c-d08dd233114e",
    "created_at": "Fri Feb 15 20:30:37 UTC 2019",
    "company": "Custom Ink",
    "company_url": null,
    "location": "Fairfax",
    "title": "DevOps Engineer",
    "description": "<p>Custom Ink, the leader in custom apparel for groups and communities, is all about bringing people together. That's what inspires our innovative online platform, world-class customer support, and award-winning work environment. With 1,500+ team members (“Inkers”) and $350M in revenue, we are passionate about the success and well-being of our team and have earned frequent recognition as a top workplace from such organizations as Fortune Magazine and The Washington Post. Our customers are counting on us to come through for them, and that’s important to all Inkers - no matter what role they’re in.</p>\n<p><strong>How you’ll make a difference:</strong></p>\n<p>We seek a friendly, reliable, and highly motivated individual with strong communication skills to join the Web Operations Team.  As a member of this team, you will provide our eCommerce and Operations Technology groups with IT Operations support for our external sites and internal facing applications.  You must be a positive and proactive problem-solver with the ability to think on your feet while providing excellent customer service.</p>\n<p><strong>What you’ll do:</strong></p>\n<p>As a Custom Ink WebOps Engineer, you’ll work daily with about 6 other WebOps teammates, as well as our Software Engineering and Data Analytics teams. You’ll manage and provide support for our staging and production Cloud Infrastructure, mostly in AWS. Daily tasks will include troubleshooting and resolving IT related issues to include Linux, Chef automation, application code deployments, and application performance. Additional tasks will include managing your Jira ticket queue, participating in on-call rotation, and configuring and utilizing Nagios, New Relic, Grafana and other performance monitoring, troubleshooting and alerting tools.</p>\n<p>Additionally, you’ll have the opportunity to help us design and build out our next version model for managing Cloud Infrastructure more flexibly and responsively. You’ll get to explore a variety of Cloud tools and technologies such as serverless computing, machine learning and containers, etc. as we expand our usage of them.</p>\n<p>Self-motivation and ability to learn on the job is vital to your success.  You will be fanatical about customer satisfaction, possess the ability and desire to master new and relevant technologies, and be able to effectively translate these into your daily responsibilities. In this role you should be comfortable taking ownership over small projects with minimal direction.</p>\n<p><strong>What we’re looking for:</strong></p>\n<p>This position requires flexibility to work additional hours and be on-call when necessary.  In addition, the ideal candidate will have:</p>\n<ul>\n<li>5+ years of IT/DevOps experience</li>\n<li>Experience with at least one Linux distribution is required, Ubuntu is preferred</li>\n<li>Some background with Chef is required</li>\n<li>Basic understanding of managing an IaaS/PaaS is required; familiarity with Amazon Web Services is required. Azure or Google Cloud Platform exposure is a plus</li>\n<li>Some experience with AWS CloudFormation is a must</li>\n<li>Demonstrated ability to work independently and as part of a team, including on-call and after-hour support</li>\n<li>Experience as primary point of contact and demonstrated expertise interacting with with Software Engineering teams</li>\n<li>Experience with system implementations and process improvements</li>\n<li>Effective communication and problem-solving skills</li>\n</ul>\n<p><strong>Technical Skills:</strong></p>\n<p>This positions requires journeyman level skills in most of these technologies:</p>\n<ul>\n<li>Database administration of one platform (Oracle, MySQL)</li>\n<li>Deployment and version control software such as Jenkins, TravisCI, AWS CodeDeploy, Capistrano and Git</li>\n<li>Scripting familiarity in Bash, Ruby, or Python</li>\n<li>Monitor and alarming software like Nagios and New Relic</li>\n<li>Log aggregation and and analysis tools like Sumo Logic or Splunk</li>\n<li>Knowledge of Ruby on Rails and apache</li>\n</ul>\n<p>In addition, you must share our company values—practicing the Golden Rule, taking Ownership and driving and embracing Innovation.</p>\n",
    "how_to_apply": "<p>Please visit our career site to apply directly: <a href=\"https://app.jobvite.com/j?cj=owyi9fwf&amp;s=Github\">https://app.jobvite.com/j?cj=owyi9fwf&amp;s=Github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckJlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8f8fde301c9b86155ec47b0a035aeb84d291b65f/CI_Inky_Red_Horizontal_Logowordmark_RGB.jpg"
  },
  {
    "id": "93778181-2eaf-451b-9eb1-f3f7ca56b630",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/93778181-2eaf-451b-9eb1-f3f7ca56b630",
    "created_at": "Fri Feb 15 17:54:10 UTC 2019",
    "company": "Wealthfront",
    "company_url": "https://www.wealthfront.com/careers",
    "location": "Redwood City",
    "title": "Senior Frontend Engineer",
    "description": "<p>We’re looking for engineers who are excited to focus on product engineering across our frontend web server and client-side application and to contribute to other key parts of our infrastructure.</p>\n<p><strong>What You'll Work On</strong></p>\n<p><strong>Desktop and Mobile Web Application:</strong> We rely on a JRuby on Rails application to serve desktop and mobile web traffic. Some of the interesting challenges we’ve worked through include scaling to hundreds of concurrent requests with multi-threading on the JVM and using Java’s Reflection API to better facilitate communications with our backend services.</p>\n<p><strong>Roswell:</strong> As frontend engineers, we collaborate with a world-class and highly technical design team. Through this collaboration, we developed Roswell, our UI toolkit and visual style guide for making beautiful and standards compliant online products. It is designed for modern web browsers and uses reusable React components, performant CSS animations and our SASS testing library, Sassaby.</p>\n<p><strong>Test, Build and Deployment Infrastructure:</strong> We deploy our frontend services multiple times per hour and are constantly scaling to support more users, services, and engineers, so we’re heavily invested improving this infrastructure. We ascribe significant value to i) tools and libraries that keep our automated tests reliable and fast and ii) stable build and deployment infrastructure that scales as we grow.</p>\n<p><strong>Data Platform:</strong> We strive to make decisions using objective criteria and automate manual processes wherever possible. As such, frontend engineers frequently contribute to a range of projects on our data platform spanning from building frontend infrastructure operability dashboards and visualizing the results of A/B tests to gathering data to make informed product or technology decisions.</p>\n<p><strong>What You Have</strong></p>\n<ul>\n<li>3+ years in a frontend engineering role</li>\n<li>Advanced knowledge of vanilla JavaScript</li>\n<li>Experience with Ruby on Rails or similar server-side framework (such as Express or Django)</li>\n<li>Real passion for agile, test-driven development, continuous integration, and automated testing</li>\n<li>BS, MS, or PhD in computer science, math, physics, or related field</li>\n</ul>\n<p>Everyone across the financial spectrum deserves to live secure and rewarding lives. In order to successfully serve clients across the United States, the Wealthfront team is focused on hiring team members with a diverse range of backgrounds, experiences and perspectives. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
    "how_to_apply": "<p>Interested? <a href=\"https://jobs.lever.co/wealthfront/95a72722-5c4d-4000-92dd-b292ee23db98?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">Apply here</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXRlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d61554a087ee178777b6056460e16ef49627cf53/circle%20logo.png"
  },
  {
    "id": "576768f1-6222-4952-b69c-450a7167da2b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/576768f1-6222-4952-b69c-450a7167da2b",
    "created_at": "Fri Feb 15 17:40:36 UTC 2019",
    "company": "ioFABRIC Inc.",
    "company_url": "http://www.iofabric.com",
    "location": "Toronto",
    "title": "Python Developer ",
    "description": "<p><strong>ioFABRIC</strong> is a data management and data security platform. We are looking for eager developers to join our start-up team and help implement back-end systems and infrastructure for our platform. We are looking for 2 people who know their way around Linux and have the skills to work with our dev team to design and build systems.</p>\n<p><strong>The</strong> <strong>Role</strong>\n· Contribute to the design and architecture of our core systems\n· Actively participate in code reviews and design planning\n· Design, build and optimize systems for maintainability and rapid scaling\n· Preference given to people with experience in Linux systems management (Centos/RedHat)</p>\n<p><strong>Requirements</strong>\n· Bachelor’s degree in any technical discipline or equivalent work experience\n· At least 3 years work experience and extensive experience with Python\n· Understand of fundamental design principles behind a sustainable and scalable application\n· Based in Toronto, familiar with working in agile team setup, and keen on start-ups</p>\n<p><strong>Salary</strong>: $60,000.00 to $95,000.00 /year depending on experience</p>\n<p><strong>Education</strong>: Bachelor's Degree (Preferred)</p>\n<p><strong>Location</strong>: Toronto, ON (Required)</p>\n<p><strong>Language</strong>: English (Required)</p>\n",
    "how_to_apply": "<p>Send your resume to <a href=\"mailto:jobs@iofabric.com\">jobs@iofabric.com</a>.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDFlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--19cc78bd797370d3762b06e4bfef70c9cfbb8ed8/ioFABRIC-logo-small2.png"
  },
  {
    "id": "3ef93499-e46b-4495-98ac-8ec02600a5be",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3ef93499-e46b-4495-98ac-8ec02600a5be",
    "created_at": "Fri Feb 15 17:09:16 UTC 2019",
    "company": "Kiwix",
    "company_url": "https://www.kiwix.org",
    "location": "remote",
    "title": "Android dev",
    "description": "<p><strong><a href=\"https://www.kiwix.org\">Kiwix</a></strong> is a vital service that provides internet content to people without internet access. It’s a digital library that enables websites to be viewed offline in the same way they’re viewed online.</p>\n<p>Kiwix Android is only five years old but it has already reached a broad audience of around three hundred thousand active users. We are searching for an experienced Android developer who is passionate about user experience to build version 3 of Kiwix Android. In this role, you will be responsible for:</p>\n<p>Revamping the library interface to improve user experience\nStabilizing the ZIM download service\nImproving automated testing infrastructure\nImproving continuous integration</p>\n<p><strong>Your profile</strong>\nYou are a developer committed to (or at least familiar with) open source software and ready to work with a team of volunteer developers in an open, collaborative environment.</p>\n<p>You have a degree in computer science and a track record on Android we can look at. We have a particular interest in your skills with:</p>\n<ul>\n<li>Android Service Lifecycle, including the role of notifications and recovery from being killed by the system</li>\n<li>Android Content providers and the Android Webview</li>\n<li>Android UI design/mockup and tests (we use Espresso)</li>\n<li>Java JNI as most of the backend code is written in C++</li>\n<li>Build process including native compilation and compilation of multiple build variants/flavours\nMVP style architectures</li>\n</ul>\n<p>You are independent and have a good sense for time/work estimation, software architecture and software quality.</p>\n<p><strong>Timeline &amp; Logistics</strong>\nThe contract runs over the next 6 months at a 60-100% FTE and can be executed remotely.</p>\n<p><strong>About Kiwix</strong>\nKiwix is a free software project aiming to provide access to free knowledge to people without access to Internet. It is based in Switzerland and supported (amongst others) by the Wikimedia movement, of Wikipedia fame.</p>\n<p><strong>Next steps</strong>\nYou can have a look at open tickets <a href=\"https://github.com/kiwix/kiwix-android/issues\">here</a> to get an idea of where we are. If you are still interested, send us an email (including cover letter and CV), at <strong><a href=\"mailto:jobs@kiwix.org\">jobs@kiwix.org</a></strong></p>\n",
    "how_to_apply": "<p>Email your resume at <a href=\"mailto:jobs@kiwix.org\">jobs@kiwix.org</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFZlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--50a9b9c401872e84f20f9694df28622bd2d38d88/KiwixLogo%20vignette.png"
  },
  {
    "id": "005cc9c7-9a5b-425b-a2d9-de1216fefc54",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/005cc9c7-9a5b-425b-a2d9-de1216fefc54",
    "created_at": "Thu Feb 14 16:06:29 UTC 2019",
    "company": "Peakon",
    "company_url": "https://peakon.com/",
    "location": "Copenhagen",
    "title": "Senior Backend Engineer",
    "description": "<p><em>DESCRIPTION</em></p>\n<p>At some companies you can feel the momentum building. People are engaged, they're approaching their work with energy, enthusiasm and resilience. Being part of the organisation becomes part of your own identity.</p>\n<p>At others, it feels impossible to get everyone pulling in the same direction. People lose sight of the company's purpose, they start looking out only for themselves – or elsewhere for new opportunities.</p>\n<p>We started Peakon to help companies around the world build better workplaces. Where employees know they're listened to, managers learn from their own decisions and develop as leaders, and entire organisations see a step-change in what they can achieve.</p>\n<p>Trust and transparency guide everything we do. At Peakon you’ll find a transparent salary model, unlimited vacation, minimal hierarchy, and maximum freedom to develop and execute your own ideas. Our style of collaboration is based on honesty and friendship, and we always love making new friends…</p>\n<p><em>ABOUT YOU</em></p>\n<p>You are an engineer at heart, who loves to tinker and build new products. You stay up to date on the latest technology trends, and are able to evaluate the feasibility of new technologies for the problem you are trying to solve.</p>\n<p>You have a passion for building great products for end users, experience in running and maintaining a large scale web application, and have a good understanding of agile product development processes and what it takes to bring a product from idea into the hands of customers. You are good at breaking down problems and prioritizing the development effort, and have an understanding of the tradeoffs in developing a quality application while supporting the needs of a fast growing business.</p>\n<p>You are looking for an opportunity to grow your career in a startup and help define and shape the engineering team and the technology it depends on.</p>\n<p><em>RESPONSIBILITIES</em></p>\n<p>As the Peakon engineering team grows, we are looking for an experienced backend engineer to be part of and lead our technical efforts. As a Senior Backend Engineer, you will be working as a senior developer to design and develop the more complex features of the Peakon platform. You will also be a key contributor in technical and architectural discussions, and work closely with our CTO and other leaders to develop the technical roadmap.</p>\n<p>You will spend a significant part of your time mentoring other team members in designing and implementing new features, through f.ex. code reviews and pair programming.</p>\n<p><em>REQUIREMENTS</em></p>\n<p><em>Our ideal candidate has...</em></p>\n<ul>\n<li>3+ years of working as a Backend Engineer</li>\n<li>Intimate knowledge of web technologies like JavaScript, REST, JSON, CSS, HTML etc</li>\n<li>Experience running and maintaining large scale web applications</li>\n<li>Experience designing and implementing complex web applications</li>\n<li>Experience working with relational databases like PostgreSQL or MySQL</li>\n<li>Detail-oriented, focusing on writing maintainable code of high quality</li>\n<li>A product mindset - enjoys experimenting to find innovative solutions to customer challenges</li>\n<li>Believes in and practices automated testing at all levels</li>\n<li>Values developer productivity, and relies on continuous integration and automation to iterate faster</li>\n<li>Is a team player who strive to better not only themselves, but also everyone around them</li>\n<li>Experience mentoring and giving constructive feedback to junior engineers on their work</li>\n</ul>\n<p>We welcome your application even if you do not meet all of the criteria listed above, but are excited about the challenge of mastering this role. We know that skills are not static and growth is continuous, so we are excited to help you take your career to the next level at Peakon.</p>\n<p><em>THE TECH</em></p>\n<p>We make it a priority to stay on the cutting edge of tech. We are highly motivated by learning and growing in our roles, and constantly evolving is a key part of that.</p>\n<p>The tech stack of Peakon centers around Javascript, with Node.js on the server and React on the frontend. We believe there is great value in a shared toolchain across the stack, enabling engineers to work on all parts of the system. Some tasks are better solved with different tools, and thus we use f.ex. Python for the data science parts of the system.</p>\n<p>We are big fans of new JavaScript language features like async/await, and have made it a priority to stay up to date with the latest versions of Node. We are primarily hosted on Heroku and AWS, with an increasing number of our services moving to the latter. We use PostgreSQL (through RDS), Redis and ElasticSearch for storage.</p>\n<p>We rely heavily on automated testing on all levels of the application, with thousands of tests checking every commit to our code base. We use CircleCI for hosted continuous integration to make sure our most recent changes are always available to test, and we deploy code to our production environment on a daily basis.</p>\n<p><em>BENEFITS</em></p>\n<ul>\n<li>Unlimited holiday</li>\n<li>Subsidised lunch everyday</li>\n<li>Flexible working</li>\n<li>Company wide trips</li>\n<li>Choice of hardware</li>\n<li>Flexible travel policy</li>\n<li>Pension</li>\n</ul>\n",
    "how_to_apply": "<p>Please email your CV to <a href=\"mailto:lea.schmidt@peakon.com\">lea.schmidt@peakon.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3BlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de3789d9e7c73910fdf74042bcde5d5864aec026/peakon-logo.png"
  },
  {
    "id": "f3f7e5d5-4018-47dd-89c3-e19e7650f120",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f3f7e5d5-4018-47dd-89c3-e19e7650f120",
    "created_at": "Thu Feb 14 19:15:02 UTC 2019",
    "company": "Western Carolina University",
    "company_url": "https://www.wcu.edu",
    "location": "Cullowhee, North Carolina",
    "title": "Junior Web Developer",
    "description": "<p>We are looking for a web developer with a back-end focus to complete our current web team! The current team of three handles CMS management, web content, and digital design, and we are seeking to round out the team by adding the technical skills of a developer. As part of University Marketing, our web team brings the skills of an IT team to a creative and innovative department of designers and marketers. We manage the primary wcu.edu website and other associated digital spaces.</p>\n<p>In this position, you would be working with the team to build and maintain the university website by developing and integrating new components of the CMS, creating database connections, troubleshooting problems, debugging coding issues, and supporting the integration of social media APIs and external tools into the website. You would work with the team to build and customize unique one-off websites (sometimes static HTML sites) and affiliate sites (often in WordPress) to support marketing, advancement, and university goals. Duties will also include collaborating with partners in IT, applications development, and network management to manage technical aspects and back-end issues of the university web space. Our systems utilize Windows and Linux servers.</p>\n<p>You will be part of a team that is location-based (this is not a remote position). While you would typically work office hours (Monday-Friday, typically eight (8) hours per day, 8 am-5 pm), you may be required to work after hours and weekends to meet deadlines or minimize service disruption. You may also be on-call periodically to help with urgent requests and to resolve and restore functionality to disrupted or failing web components. Our campus is located in the beautiful mountains of western North Carolina, so you can expect to spend your downtime enjoying the outdoors and the numerous activities and events the region has to offer.</p>\n<p>Our ideal candidate has the following qualities:</p>\n<ul>\n<li>Ability to meet with stakeholders, understand business needs and requirements, and implement solutions to meet those needs</li>\n<li>Ability to explain technical matters clearly to end users and stakeholders who may have little knowledge of IT</li>\n<li>Approaches requests with ownership and consistently demonstrates a strong work ethic and quality output</li>\n<li>Excellent attention to detail</li>\n<li>Willingness to back-fill other team members’ responsibilities when needed</li>\n<li>Versatile. Ability to adapt to changing circumstances, project schedules, and a variety of requests</li>\n<li>Ability to work on multiple projects at a variety of stages within a project lifecycle and to use/work with different project management approaches to achieve goals</li>\n<li>Demonstrated problem-solving skills and a logical approach to work</li>\n<li>Willingness to learn and expand in new areas</li>\n</ul>\n<p>Minimum Qualifications:</p>\n<p>A bachelor’s degree with 1 to 3 years’ experience or equivalent combination of relevant education &amp; experience.</p>\n<ul>\n<li>Knowledge of modern coding standards and best practices</li>\n<li>Experience or demonstrated training in IIS7, ASP, C#, MySQL, Apache, and PHP</li>\n<li>Experience or demonstrated training in JavaScript, HTML, CSS, and XSL/XML</li>\n<li>Familiarity with basic design principles</li>\n<li>Experience with at least two website content management systems</li>\n<li>Experience or demonstrated training in ensuring browser and device compatibility, methods for degrading for older browsers and displays and file compression techniques for improving speed</li>\n<li>Knowledge of strategies for ongoing improvement and optimization of website load speed and site performance</li>\n<li>Ability to work independently and on a team</li>\n<li>Ability to manage project load with minimal to moderate supervision</li>\n</ul>\n<p>Preferred Qualifications:</p>\n<p>Experience with large enterprise wide websites over 5000 pages</p>\n<ul>\n<li>Preference given to candidate with experience in OmniUpdate Campus</li>\n<li>Familiarity with the implementation of web accessibility standards</li>\n<li>Familiarity with WordPress</li>\n<li>Experience working with a web designer on all stages of a web project</li>\n<li>Strong customer service and communication skills</li>\n</ul>\n",
    "how_to_apply": "<p>Complete the online application at: <a href=\"https://jobs.wcu.edu/postings/9988\">https://jobs.wcu.edu/postings/9988</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzllIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--07f4ef0b138d6f3d815f1dfc9821d6bdb5cdc771/WCU-logo-purple.jpg"
  },
  {
    "id": "003691be-7cb2-40f2-8056-35e4e73d40ea",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/003691be-7cb2-40f2-8056-35e4e73d40ea",
    "created_at": "Thu Feb 14 18:39:55 UTC 2019",
    "company": "Tor Project",
    "company_url": "https://www.torproject.org/about/jobs-backenddeveloper.html.en",
    "location": "Italy, Seattle, or Remote",
    "title": "Backend Engineer (OONI/Tor Project)",
    "description": "<p>Internet Freedom Nonprofit Seeks Backend Engineer for OONI</p>\n<p>The Tor Project, Inc. is looking for a dedicated backend engineer to work on OONI (<a href=\"https://ooni.torproject.org/\">https://ooni.torproject.org/</a>). OONI is the Open Observatory of Network Interference: a free and open source software, global observation network for detecting censorship, surveillance, and traffic manipulation on the internet.</p>\n<p>You will be working to improve OONI’s data processing pipeline and other backend components responsible for recording measurements collected from our growing global user network. You will also be tasked with improving our network measurement methodologies and data analysis heuristics to increase the accuracy of our experiments.</p>\n<p>This is a full-time 12-month contract position, starting ASAP (no later than mid-May 2019); contract may be extended.</p>\n<p>The OONI team is based in Europe. However, this position may be performed remotely.</p>\n<p>Here are some of our code repositories:</p>\n<p><a href=\"https://github.com/ooni/api\">https://github.com/ooni/api</a>\n<a href=\"https://github.com/ooni/pipeline\">https://github.com/ooni/pipeline</a>\n<a href=\"https://github.com/ooni/orchestra\">https://github.com/ooni/orchestra</a>\n<a href=\"https://github.com/ooni/collector\">https://github.com/ooni/collector</a>\n<a href=\"https://github.com/ooni/sysadmin\">https://github.com/ooni/sysadmin</a></p>\n<p>Required skills and qualifications:</p>\n<ul>\n<li>Extensive experience in python or golang.</li>\n<li>Comfortable working remotely.</li>\n<li>Self-directed, self-disciplined, but good at working and communicating with a team.</li>\n<li>Have experience and be comfortable with others reviewing your code and design; have experience and be comfortable reviewing others’ code.</li>\n<li>Experience documenting and designing protocols.</li>\n<li>Be comfortable with transparency!</li>\n</ul>\n<p>Preferred qualifications:</p>\n<ul>\n<li>Experience designing, implementing, and maintaining scalable complex network applications.</li>\n<li>Working experience with data processing pipelines.</li>\n<li>Possess the confidence to refactor code and write unit-tests.</li>\n<li>Familiarity with the challenges of developing and scaling data processing pipelines.</li>\n<li>Familiarity with the network measurement field.</li>\n<li>Experience with open-source software development, including working with distributed teams across different time-zones containing employees and volunteers of differing skill levels.</li>\n<li>Basic familiarity with distributed version control systems.</li>\n<li>Contributed significant chunks of code to multiple open-source projects in the past.</li>\n<li>Be passionate about internet freedom and interested in contributing to it in a concrete way!</li>\n</ul>\n<p>Other notes:</p>\n<p>Academic degrees are great but not required if you have the right experience.</p>\n<p>You should be very good at working remotely at communicating with the team on a daily basis via Slack, IRC, instant messaging, email, and issue trackers.</p>\n<p>Salary negotiable.</p>\n<p>How to apply:</p>\n<p>Please email a <em>PDF</em> of your resume/CV, and a cover letter explaining how your qualifications and experience meet the requirements of this job description. Please include the reasons why you want to work on OONI. Please also include link to one or several code samples (of which you are authorized to share), and also your GitHub or GitLab profile, and three professional references.</p>\n<p>Email should be sent to jobs at openobservatory dot org with \"OONI Backend Engineer\" in the subject line.</p>\n<p>About the project:</p>\n<p>The Open Observatory of Network Interference (OONI) is a free software project under the Tor Project. OONI collects and processes network measurements with the aim of detecting network interferences, such as censorship, surveillance, and traffic manipulation. Since late 2012, OONI has collected millions of measurements across more than 90 countries around the world.</p>\n<p>The Tor Project, Inc., is a 501(c)(3) organization headquartered in Seattle with paid staff and contractors of around 45 engineers and operational support people, plus many volunteers all over the world. Tor develops free and open source software for privacy and freedom online, protecting people from tracking, surveillance, and censorship. The Tor Project’s mission is to advance human rights and freedoms by creating and deploying free and open source anonymity and privacy technologies, support their unrestricted availability and use, and further their scientific and popular understanding.</p>\n<p>The Tor Project, Inc., is an equal opportunity, affirmative action employer.</p>\n",
    "how_to_apply": "<p>How to apply:</p>\n<p>Please email a <em>PDF</em> of your resume/CV, and a cover letter explaining how your qualifications and experience meet the requirements of this job description. Please include the reasons why you want to work on OONI. Please also include link to one or several code samples (of which you are authorized to share), and also your GitHub or GitLab profile, and three professional references.</p>\n<p>Email should be sent to jobs at openobservatory dot org with \"OONI Backend Engineer\" in the subject line.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3hlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--84cc7547c542b208b86a19041292966e09ac5cd2/Tor%20Logo%20Small.png"
  },
  {
    "id": "4163d6b2-24c9-41fa-b283-16cf438fe2ea",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4163d6b2-24c9-41fa-b283-16cf438fe2ea",
    "created_at": "Thu Feb 14 15:54:53 UTC 2019",
    "company": "Gefest Services Ltd",
    "company_url": "http:",
    "location": "Quebec City, QC",
    "title": "Gefest Services Ltd",
    "description": "<p>About the role:</p>\n<p>He will work closely with the billing team, responding to daily customer inquiries by email and phone, and also helps with invoicing and billing for administrative functions.\nPay close attention to details, excellent time management skills and be able to communicate with internal and external customers.\nInitially, this is a three-month contract with the prospect for a permanent candidate.</p>\n<p>Main responsibilities:</p>\n<ul>\n<li>Interaction with internal employees</li>\n<li>Entering customer billing data in a database</li>\n<li>Check invoices and customer schedules</li>\n<li>View and manage the client portal mailbox</li>\n<li>Working with a credit group to respond to general billing requests</li>\n</ul>\n<p>Primary requirements:</p>\n<ul>\n<li>Excel intermediate skills</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Great phone</li>\n<li>The opportunity to work in an organized and process-oriented team</li>\n<li>Ability to work under pressure and meet strict deadlines</li>\n</ul>\n<p>Salary:  -  20-24 CAD / per hour\nType of job:  Full time.</p>\n",
    "how_to_apply": "<p><a href=\"mailto:gilmer.yvonne@yahoo.ca\">gilmer.yvonne@yahoo.ca</a></p>\n",
    "company_logo": null
  },
  {
    "id": "ef4490ba-7c1e-48c3-96a8-4476ff825b20",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ef4490ba-7c1e-48c3-96a8-4476ff825b20",
    "created_at": "Thu Feb 14 15:50:31 UTC 2019",
    "company": "Gefest Services Ltd",
    "company_url": "http:",
    "location": "Edmonton, AB",
    "title": "Administrative Assistant",
    "description": "<p>About the role:</p>\n<p>He will work closely with the billing team, responding to daily customer inquiries by email and phone, and also helps with invoicing and billing for administrative functions.\nPay close attention to details, excellent time management skills and be able to communicate with internal and external customers.\nInitially, this is a three-month contract with the prospect for a permanent candidate.</p>\n<p>Main responsibilities:</p>\n<ul>\n<li>Interaction with internal employees</li>\n<li>Entering customer billing data in a database</li>\n<li>Check invoices and customer schedules</li>\n<li>View and manage the client portal mailbox</li>\n<li>Working with a credit group to respond to general billing requests</li>\n</ul>\n<p>Primary requirements:</p>\n<ul>\n<li>Excel intermediate skills</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Great phone</li>\n<li>The opportunity to work in an organized and process-oriented team</li>\n<li>Ability to work under pressure and meet strict deadlines</li>\n</ul>\n<p>Salary:  -  20-24 CAD / per hour\nType of job:  Full time.</p>\n",
    "how_to_apply": "<p><a href=\"mailto:gilmer.yvonne@yahoo.ca\">gilmer.yvonne@yahoo.ca</a></p>\n",
    "company_logo": null
  },
  {
    "id": "ec4a47df-5580-4d61-87de-add4793d7ad1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ec4a47df-5580-4d61-87de-add4793d7ad1",
    "created_at": "Thu Feb 14 15:38:19 UTC 2019",
    "company": "Marfeel ",
    "company_url": "https://www.marfeel.com/",
    "location": "Barcelona",
    "title": "Senior Front End Developer- React ",
    "description": "<p>Marfeel helps publishers of all sizes to create, optimize and monetize their mobile websites. We have been named 16th fastest-growing European company of 2018, by The Financial Times, but we still think we have a long way to go to where we want to be.</p>\n<p>We are looking for talented Front-end Engineers to join our Core product team and be part of a multicultural and talented Engineering team of over 70 developers, in sunny Barcelona.</p>\n<p>You will be part of a team who owns the performance and the architecture of our front-end ecosystem that supports over 15 million visits a day. Currently we are in the process of redefining our architecture in React. Fancy helping us?</p>\n<p>You will:</p>\n<p>Be part of a multicultural and talented company, consisting of 28 nationalities.</p>\n<p>Help us define and implement our new front-end architecture</p>\n<p>Have a say in what libraries, tools and technologies we use for front-end development</p>\n<p>Join a fun and dynamic Core product team that follows Agile practices.</p>\n<p>Have opportunity and support to grow and develop your career further</p>\n<p>Be able to help us shape our rapidly growing Engineering department</p>\n<p>What the team is looking for:</p>\n<p>You have proven experience in delivering end-to-end features in ReactJS and other modern Javascript front-end technologies for mobile applications</p>\n<p>You have worked with Styled Components and style sheet languages, such as SASS</p>\n<p>You know different ways of managing application state in the front-end</p>\n<p>You have a solid understanding of the web technology stack (i.e. headers, cookies, cross-domain restrictions, https, caching, optimization opportunities, hardware acceleration, junk and scroll performance, server side rendering etc.)</p>\n<p>You are familiar with modern development and build tools such as git, npm, babel, and webpack</p>\n<p>You have experience working in cross-functional collaborative teams, following Agile best practices</p>\n<p>You are comfortable contributing to and leading technical and/or architectural discussions</p>\n<p>You take ownership of your and your team's code quality. Writing tests is in your second nature, and you have a broad understanding of UI testing techniques</p>\n<p>You continually strive to share your knowledge around best code practices</p>\n<p>You have high emotional intelligence and finding it easy to empathise with others</p>\n<p>You don’t take yourself too seriously and enjoy a few jokes now and then</p>\n<p>The team will be further impressed with:</p>\n<p>You have experience with developing Progressive web applications, service workers, push notifications</p>\n<p>You know how to analyse and optimise the performance of a front-end application</p>\n<p>You have experience with various AWS services and understand the challenges of deploying large applications in the cloud.</p>\n<p>You are an active contributor to a front-end community</p>\n<p>You have worked with Jenkins and familiar with CI and CD release cycles</p>\n<p>You have experience with backend languages and frameworks such as NodeJS, Java, Python or any others</p>\n<p>You are familiar with #perfMatters, VueJS, Google Analytics, AdServing, Linters</p>\n<p>As part of Marfeel, you will also have:</p>\n<p>Flexible working-time</p>\n<p>Free coffee, tea, juices and other commodities</p>\n<p>Beer tap in the kitchen</p>\n<p>Ping-pong, Mario Kart and foosball tournaments</p>\n<p>Free language and yoga classes</p>\n<p>Team building events!</p>\n<p>Transport, restaurant and kindergarten tickets</p>\n<p>Training, books and all you need to feel empowered</p>\n<p>And a Referral Bonus if you bring other talented people like you</p>\n<p>A little bit more about us:</p>\n<p>Marfeel is one of the hottest European start-up companies in the mobile ad-tech world.</p>\n<p>We have been named:</p>\n<p>16th out of Europe’s 1000 fastest-growing companies of 2018, by The Financial Times</p>\n<p>Nº 1 Fastest Growing Marketing and Advertising Private Company in Spain in 2017, by Inc.5000</p>\n<p>Top 100 Startups in 2015, by Wired Magazine</p>\n<p>We are highly recommended by Google for our mobile design solution, and together with our partners, we have over 6 billion worldwide readers and over 20 billion page views.</p>\n<p>Certified Google Publishing Partner</p>\n<p>Certified Facebook Instant Articles Official Partner</p>\n",
    "how_to_apply": "<p>Apply to this link <a href=\"https://marfeel.bamboohr.com/jobs/view.php?id=53\">https://marfeel.bamboohr.com/jobs/view.php?id=53</a> or send an email to <a href=\"mailto:jobs@marfeel.com\">jobs@marfeel.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1ZlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfe02b00f5b096b96e4871c9cbcbc40c308fe1a1/marfeel-logo%20(1).png"
  },
  {
    "id": "0357d2ed-1b97-44d6-ab09-fabc8177d500",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/0357d2ed-1b97-44d6-ab09-fabc8177d500",
    "created_at": "Thu Feb 14 13:19:23 UTC 2019",
    "company": "Elbe Finanzgruppe AG",
    "company_url": "https://www.elbe-finanzgruppe.de",
    "location": "Dresden, Germany",
    "title": "Software Engineer Backend (m/w/d)",
    "description": "<p><strong>English version below</strong></p>\n<p><strong>Über die Elbe Finanzgruppe:</strong></p>\n<p>Die <a href=\"https://www.elbe-finanzgruppe.de/\">Elbe Finanzgruppe</a> glaubt an den hohen Mehrwert von Unternehmern für die Gesellschaft und möchte diese unterstützen. Ziel der Elbe Finanzgruppe ist es, erfolgreiche Freiberufler, Start-ups &amp; mittelständische Unternehmen mit zusätzlicher Liquidität noch erfolgreicher zu machen. Durch unsere Vielzahl an alternativen aufeinander abgestimmten Finanzierungslösungen bieten wir unseren Partnern alles aus einer Hand. Folgende Lösungen befinden sich heute in unserem Portfolio: Factoring, Leasing, Finetrading und Inkasso.</p>\n<p>Mit <a href=\"https://rechnung48.de\">Rechnung48</a> und <a href=\"https://amacash.de\">AmaCash</a> bieten wir bereits heute erste digitale Lösungen, um unseren Kunden passende Finanzierungsmöglichkeiten noch einfacher &amp; schneller zur Verfügung stellen zu können. Als FinTech möchten wir den Markt noch stärker aktiv mitgestalten – und suchen daher Dich zur Unterstützung unserer cross-funktionalen Entwicklungsteams!</p>\n<p><strong>Deine Aufgaben:</strong></p>\n<ul>\n<li>Weiterentwicklung unserer Backend-Landschaft um neue Microservices in cross-funktionalen Feature-Teams</li>\n<li>Gemeinschaftliches Design und Implementierten  privater &amp; öffentlicher APIs</li>\n<li>Anbindung von Drittanbieter APIs an unsere internen Systeme</li>\n<li>Verwaltung großer Datenmengen unter Einsatz von Datenbanksystemen</li>\n<li>Konfiguration, Deployment und Maintenance des Backends in Cloud-Umgebungen unter Zuhilfenahme von Infrastructure-as-Code-Lösungen</li>\n</ul>\n<p><strong>Dein Profil:</strong></p>\n<ul>\n<li>Mindestens 3 Jahre praktische Berufserfahrung als Softwareentwickler</li>\n<li>Sehr sicherer Umgang in mind. 2 Hochsprachen (z.B. Go, PHP)</li>\n<li>Erfahrung mit agilen Entwicklungsmethoden wie Scrum oder Kanban</li>\n<li>Kenntnisse im Umgang mit relationalen und NoSQL-Datenbanken und in der Entwicklung von skalierbaren Anwendungen sind bevorzugt</li>\n<li>Du kannst die Begriffe Docker, Kubernetes, Swagger/ gRPC und Microservices einordnen</li>\n<li>Gute Englischkenntnisse in Wort und Schrift</li>\n</ul>\n<p><strong>Unser Angebot:</strong></p>\n<ul>\n<li>Ein stark wachsendes und dynamisches Unternehmen der Finanzbranche</li>\n<li>Flache Hierarchien mit kurzen Entscheidungswegen</li>\n<li>Ein kompetentes, junges Team</li>\n<li>Großer Freiraum für die persönliche Entwicklung</li>\n<li>Gemeinsame Aktivitäten in einem tollen Team</li>\n<li>Frisches Obst, Kaffee und Tee</li>\n<li>Ein attraktiver Arbeitsplatz im Herzen von Dresden</li>\n<li>Hardware nach Deinem Wunsch</li>\n</ul>\n<p>Jetzt bewerben und Teil unserer Erfolgsstory werden: <a href=\"mailto:karriere@elbe-finanzgruppe.de\">karriere@elbe-finanzgruppe.de</a></p>\n<p>Hier geht's zur <a href=\"https://www.elbe-finanzgruppe.de/unternehmen/karriere/stellenangebote/Software-Engineer-Backend-m-w-d\">Stellenanzeige</a>!</p>\n<p><strong>About the Elbe Finanzgruppe:</strong></p>\n<p>The Elbe Finanzgruppe   believes in the high value of small entrepreneurs for our society and would like to support them. The aim of the Elbe Finanzgruppe is to make successful freelancers, start-ups and medium-sized companies even more successful with additional liquidity. Thanks to our tailored alternative financing solutions, we offer our partners a wide range of services from a single source: Factoring, leasing, finetrading and debt collection.</p>\n<p>With our products Rechnung48  and AmaCash,   we are offering the first digital solutions to provide our customers with suitable financing options even more easily and quickly. As a FinTech, we would like to play an even more active role in shaping the market - and are therefore looking for you to support our cross-functional development team!</p>\n<p><strong>Your tasks:</strong></p>\n<ul>\n<li>Development of our backend landscape with new microservices in cross-functional feature teams</li>\n<li>Collaborative design and implementation of private and public APIs</li>\n<li>Connection of third-party APIs to our internal systems</li>\n<li>Management of large amounts of data using database systems</li>\n<li>Configuration, deployment and maintenance of the backend in cloud environments using infrastructure-as-code solutions</li>\n</ul>\n<p><strong>Your profile:</strong></p>\n<ul>\n<li>At least 3 years practical work experience as a software developer</li>\n<li>Very safe handling in at least 2 high-level languages (e.g. Go, PHP)</li>\n<li>Experience of agile project management frameworks such as Scrum or Kanban</li>\n<li>Handling of relational and NoSQL databases and knowledge in the development of scalable applications is preferred</li>\n<li>You understand concepts like Docker, Cubernet, Swagger/ gRPC and micro-services</li>\n<li>Good command of spoken and written English</li>\n</ul>\n<p><strong>Our offer:</strong></p>\n<ul>\n<li>A fast-growing and dynamic company in the field of financial services</li>\n<li>Flat hierarchies with short decision paths</li>\n<li>A competent and young team</li>\n<li>Room and opportunities for personal development</li>\n<li>Leisure group activities in a great team</li>\n<li>Fresh fruit, coffee and tea</li>\n<li>An attractive workplace in the heart of Dresden, Germany</li>\n<li>Hardware according to your requirements</li>\n</ul>\n<p>Apply now and become part of our success story: <a href=\"mailto:karriere@elbe-finanzgruppe.de\">karriere@elbe-finanzgruppe.de</a></p>\n",
    "how_to_apply": "<p>Jetzt bewerben auf <a href=\"mailto:karriere@elbe-finanzgruppe.de\">karriere@elbe-finanzgruppe.de</a></p>\n<p>Unsere Stellenanzeige: <a href=\"https://www.elbe-finanzgruppe.de/unternehmen/karriere/stellenangebote/Software-Engineer-Backend-m-w-d\">https://www.elbe-finanzgruppe.de/unternehmen/karriere/stellenangebote/Software-Engineer-Backend-m-w-d</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnhlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cbb2c7f20272338018639a1c0a522e0c0461e37b/01_elbefinanzgruppe_logo_01.jpg"
  },
  {
    "id": "95faddb9-63c9-4cd8-953a-ab38e643a0af",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/95faddb9-63c9-4cd8-953a-ab38e643a0af",
    "created_at": "Thu Feb 14 12:52:58 UTC 2019",
    "company": "Stylight GmbH",
    "company_url": null,
    "location": "Munich, Germany",
    "title": "Tech Lead (m/f/d)",
    "description": "<p>We are looking for a Tech Lead to join our team in Munich. You’re interested in further optimizing and automating the technical integration of our partner shops and delivering high quality software is your number one priority? Then Stylight is your place to be.</p>\n<p>Your Key Responsibilities</p>\n<ul>\n<li>Ensuring your team ships quality products and code in accordance with business needs.</li>\n<li>Build, maintain, and monitor our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team.</li>\n<li>Own services from design, development, and testing to continuous integration, monitoring, and support.</li>\n<li>Enjoy what you do, and be ready to research and learn new technologies.</li>\n<li>Explain technical topics to non-technical colleagues and advocate for your team across the company.</li>\n<li>Mentor, lead, and support a team of 3-5 engineers to foster technical excellence in the team. Bring your best practices, challenge the status quo, and set things in motion.</li>\n</ul>\n<p>Background Of Successful Applicants</p>\n<ul>\n<li>You bring hands-on experience in software development, ideally 5+ years and have experience in designing, building and operating complex, scalable systems.</li>\n<li>You have significant Python experience and are ready to share what you’ve learned with others.</li>\n<li>You want to take responsibility and ownership for the software you produce. “You build it, you run it!” is our general philosophy.</li>\n<li>You are opinionated and outspoken on engineering best practices, but can still maintain friends.</li>\n<li>You have solid experience with both relational and NoSQL databases.</li>\n<li>You have proficient English skills and are able to communicate honestly and openly with your colleagues.</li>\n<li>You’re excited to work in an environment where collaboration, continuous integration and delivery are as vital as morning coffee.</li>\n<li>Experience with Docker, AWS, and microservice architectures are a very nice plus.</li>\n</ul>\n<p>The Business Development Tech Team</p>\n<ul>\n<li>Is responsible for automating and continuously improving the technical integration tools and systems used by our business and finance teams as well as hundreds of business partners.</li>\n<li>Codes primarily in Python (mostly for backend applications) and Javascript (for interactive UIs) and is committed to the quality and health of their codebase.</li>\n<li>Works in an agile and cross-functional environment alongside our sales and partner managers.</li>\n<li>Enjoys autonomous work as well as pair programming, code reviews and learning together.</li>\n</ul>\n<p>Why join Stylight?</p>\n<ul>\n<li>Stylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community.</li>\n<li>We organize daho.am, our own annual developer conference. Top-notch speakers and over 1,000 attendees.</li>\n<li>International &amp; highly motivated environment with open business culture in all departments. Our company language is English.</li>\n<li>Hands-on work after quick ramp up &amp; openness to new solutions and improvements.</li>\n<li>A personal development budget is given to you to use throughout the year for personal growth.</li>\n<li>We are family-friendly and enjoy spending time with one another outside of working hours from board game evenings and BBQs to ping pong tournaments and Christmas tree decorating.</li>\n<li>We have one of the coolest office spaces in Munich (and actually in Germany) in the city-center, and just a 10-minute walk to the nearest Biergarten.</li>\n<li>Want to know more? Check out: about.stylight.com and blog.stylight.com // tech.stylight.com.</li>\n</ul>\n<p>Up for the challenge?</p>\n<p>If you want to work in a fun, exciting, challenging and dedicated environment, then don't hesitate and apply today via\nabout.stylight.com/jobs. We're looking forward to reading your complete application (Cover letter, CV, references and certificates) in English or German! Your contact: Carina Meyer.</p>\n",
    "how_to_apply": "<p>Apply today via about.stylight.com/jobs or send an email to <a href=\"mailto:jobs@stylight.com\">jobs@stylight.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmxlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4fd6d8771c815287c9bfeb697f0a1f0f7bb68830/logo.jpg"
  },
  {
    "id": "28392689-3726-4cd2-a8d7-8fddf4cf06bd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/28392689-3726-4cd2-a8d7-8fddf4cf06bd",
    "created_at": "Thu Feb 14 12:52:23 UTC 2019",
    "company": "HoloMeeting",
    "company_url": "http://www.holomeeting.io",
    "location": "Remote",
    "title": "Senior Unity Developer for Mixed Reality",
    "description": "<p>This role requires an experienced software engineer who knows how to lead junior developers and consistently meet company goals. We are a small team, you're the person that gets the job done. If there is a bug thrown, you fix it. In this role you will need to evaluate the highest priority problems and provide solutions through strategic thinking. A \"can-do\" attitude will take you a long way!</p>\n<p><em>Responsibilities, including but not limited to:</em></p>\n<ul>\n<li>Development of ultra-fast, massively scalable, highly available holographic meeting solution built on top of Photon</li>\n<li>Implementation of security \"best practices” to keep user data secure</li>\n<li>Working with designers, client engineering, and production teams to achieve goals</li>\n<li>Mentoring and managing junior developers</li>\n</ul>\n<p><em>Requirements:</em></p>\n<ul>\n<li>5+ years Unity experience in a professional development team (we don't count self study^^)</li>\n<li>Virtual Reality or Augmented Reality experience (ideally Microsoft HoloLens)</li>\n<li>Strong .NET/C#</li>\n<li>Photon Networking</li>\n<li>Experience working with cloud-based systems and/or local servers including, but not limited to: web-based protocols, REST APIs, and sockets</li>\n<li>BS in Computer Science</li>\n</ul>\n<p><em>Preferred:</em></p>\n<ul>\n<li>iOS/Android</li>\n<li>C++ skills (e.g. calling C++ DLLs from within Unity)</li>\n<li>Azure</li>\n</ul>\n",
    "how_to_apply": "<p>Please apply through this link: <a href=\"https://hire.withgoogle.com/public/jobs/kazendicom/view/P_AAAAABlAAAnJ77w7dRW5jz?trackingTag=githubJobs\">https://hire.withgoogle.com/public/jobs/kazendicom/view/P_AAAAABlAAAnJ77w7dRW5jz?trackingTag=githubJobs</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmRlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4e8523b68463421dfb70aeb7bcf85f04984c15e3/Favicon%2048x48%20Copy.jpg"
  },
  {
    "id": "2ccadca0-bb19-4f58-b272-570c97e6ce45",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2ccadca0-bb19-4f58-b272-570c97e6ce45",
    "created_at": "Thu Dec 13 17:40:13 UTC 2018",
    "company": "NationBuilder",
    "company_url": null,
    "location": "Los Angeles, Remote",
    "title": "Site Reliability Engineer",
    "description": "<p>As a site reliability engineer at NationBuilder, you'll be part of the team responsible for the overall reliability, availability, security, and performance of our platform. You’ll recommend and implement changes across our systems and environments, evaluate new technologies, be challenged with problems to solve, and contribute to our technological direction.</p>\n<p>NationBuilder creates software for leaders of all kinds - political candidates, nonprofit organizations, anyone building a community of people to make something happen in the world. To learn more about NationBuilder, read about our mission and beliefs.</p>\n<p>We're looking for someone who:\nHas a love of learning.\nThrives in a highly collaborative environment, enjoys the chance to pair with their peers, and gives and receives well crafted feedback.\nProficiency with one or more languages (Ruby, Go, Python).\nWorking familiarity with provisioning, automation, and configuration management solutions (terraform, puppet)\nOperational experience with public cloud environments (AWS, Google Cloud Platform, Azure)\nHave at least five years experience supporting high-volume customer facing services.\nExperience supporting and managing Docker containers from local development to production.\nKnowledge of relational databases (Postgres) and NoSQL systems (MongoDB, Couchbase, Redis).\nExtensive Linux experience and proficiency with the shell (bash, zsh, sed, awk), and networking concepts and protocols (TCP/IP, UDP, HTTP, NTP, DNS, TLS).</p>\n<p>Our stack:\nOur platform is primarily built with Ruby on Rails with some additional Ruby and Go services. Data is stored in PostgreSQL, MongoDB, Couchbase, Redis, and Hadoop. All on a cloud native architecture in AWS and managed with Terraform and Puppet.</p>\n<p>NationBuilder is an equal opportunity employer and we value diversity. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n",
    "how_to_apply": "<p>Please apply on our jobs site: <a href=\"https://hire.withgoogle.com/public/jobs/nationbuildercom/view/P_AAAAAAEAAC8Oi8icy6MaKp?trackingTag=gitHub\">https://hire.withgoogle.com/public/jobs/nationbuildercom/view/P_AAAAAAEAAC8Oi8icy6MaKp?trackingTag=gitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0paIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e7162b14906a097c6586763239948a094fffe210/nationbuilder-mark-black.png"
  },
  {
    "id": "9bd8067e-0cc7-4066-9eb6-48478cdd0966",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9bd8067e-0cc7-4066-9eb6-48478cdd0966",
    "created_at": "Wed Feb 13 10:17:39 UTC 2019",
    "company": "Shell",
    "company_url": "http://www.shell.com",
    "location": "Amsterdam",
    "title": "Blockchain Analyst | Part of Shell Graduate Programme",
    "description": "<h2>Summary</h2>\n<p>Part of our highly-reputed Graduate Programme, this placement in our Blockchain Centre of Excellence (CoE) is a chance to learn alongside some of the best minds and developers in the blockchain space and build your blockchain knowledge. You'll be exploring potential applications across Shell - from supply chain and certification to mobility and energy.</p>\n<h2>The placement</h2>\n<p>In this placement, you'll gain the skills to be a successful Blockchain Analyst with us. It's a great time to join this new team - we're still at the stage where we can educate colleagues and refine our strategy. Highlights include:</p>\n<ul>\n<li>Exploring potential applications - whether that's in our core gas and oil business or new areas such as new energies or electric vehicles.</li>\n<li>Assisting on projects from ideation to deployment, working with bright, experienced analysts.</li>\n<li>Carrying out market scans on new decentralised technology primitives.</li>\n<li>Creating value cases for opportunities for blockchain in different business areas.</li>\n<li>Helping shape the team's approach and way of working.</li>\n</ul>\n<p>This is the first of two Graduate Programme placements; your second could be in data engineering, data analytics, IT Architecture or a similar part of our business.</p>\n<h2>Who are you?</h2>\n<p>Obviously, some insight into blockchain would be useful, but it's not essential: we can bring you up to speed. You probably you have a background in Computer Science or Information Management but we're also open to hearing from cryptographers, mathematicians or game theorists.</p>\n<p>You'll be part of a start-up culture where we sometimes 'colour outside the lines' - that's something you'll need to embrace. To thrive here, you'll definitely need to be able to think on your feet - you're someone who loves coming up with original ideas and exploring different angles to solve a problem.</p>\n<h2>The Shell Graduate Programme: a world of opportunities</h2>\n<p>Join the IT Shell Graduate Programme and you can look forward to an industry-leading two- or three-year learning programme, offering real responsibility, engaging challenges and continued professional development.</p>\n<p>There's never been a more exciting time to be part of the energy industry. Start your career at Shell and immerse yourself in innovative projects to find economically, socially and environmentally responsible solutions to the world's energy needs. You'll be learning alongside brilliant people from all over the world, with the resources and support to explore new ways of thinking and working - all in all, an unbeatable experience.</p>\n<h2>Helping you prepare</h2>\n<p>We want you to be at your best when completing the assessments, so here are some top tips and some additional background information that may help you. Ace your application prep by reviewing our <a href=\"www.shell.com/careers/working-at-shell/candidate-resource-centre.html\">application tips</a>.</p>\n<h2>Ready to apply?</h2>\n<p>If you're excited by the chance to push boundaries and explore frontiers, <a href=\"https://shellinternational.redirect.your-jobresponse.com/blockchain_analyst_part_of_shell_graduate_programme_amsterdam/243041/V819/apply\">click here</a> to start your application. In the online application form, select \"IT\" as your preferred area of interest.</p>\n<p>Agency calls are not appreciated.</p>\n",
    "how_to_apply": "<p><a href=\"https://shellinternational.redirect.your-jobresponse.com/blockchain_analyst_part_of_shell_graduate_programme_amsterdam/243041/V819/apply\">Click here for the application form!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXhlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c197d320c8690420bde1f595c4711e382011c6ad/Shell.png"
  },
  {
    "id": "8ca2fd8b-f1f7-4306-9036-1c0d7f59093a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/8ca2fd8b-f1f7-4306-9036-1c0d7f59093a",
    "created_at": "Wed Feb 13 09:09:29 UTC 2019",
    "company": "KPN",
    "company_url": "https://jobs.kpn.com/vacatures/",
    "location": "Amsterdam",
    "title": "Senior AppFactory Engineer",
    "description": "<h2>Thanks to your knowledge of Kubernetes, CI / CD and Infrastructure as Code, our customers successfully build Cloud Native applications!</h2>\n<p></p>\n<p><strong>How?</strong> As a driven platform and infrastructure engineer AppFactory, you build, maintain and support a set of Kubernetes clusters and associated platform services for KPN business customers.</p>\n<p><strong>Why?</strong> Digitization makes the development of applications and other digital services increasingly relevant for organizations. Speed ​​is the decisive factor in this. The faster companies convert an idea into an application, the faster they offer users much-needed new functionalities. In our development street (AppFactory), applications are well managed and quickly brought to production.</p>\n<p><strong>Where?</strong> KPN Datacenter Amsterdam Paalbergweg.</p>\n<p><strong>With who?</strong> The AppFactory team consists of 8 passionate people, who love their profession! We help companies to accelerate in an innovative way with a sophisticated combination of our DevOps and Continuous Delivery platform.</p>\n<h2>Working on new opportunities.</h2>\n<p>Appfactory is a service of KPN in which we have mixed the next steps in the field of Continuous Delivery, Infrastructure as Code and Container Platform as a Service, so companies can quickly convert an idea into an application that they have built. We deliver the tool chain, on demand infrastructure and managed services to autonomous agile teams of our clients to take the step to DevOps, without the need for an investment in technology and expertise. In your job as AppFactory Engineer you contribute to this by:</p>\n<ul>\n<li>Building, maintaining and supporting a set of Kubernetes clusters and associated platform services for KPN business customers.</li>\n<li>Automating and standardizing Continuous Delivery (CD) pipeline \"as a Service\" functionality;</li>\n<li>Automating middleware and infrastructure stacks (traditional and open-source);</li>\n<li>Automating PAAS (Platform as a Service) functionality;</li>\n<li>Automating CAAS (Container as a Service) platform functionality;</li>\n<li>The integration and automation of / with management facilities such as logging, security and monitoring components;</li>\n<li>The performance of life-cycle management.</li>\n<li>Support to DevOps teams of business customers who use KPN AppFactory.</li>\n</ul>\n<p>You have a passion for platform and infrastructure automation.</p>\n<p>We work with innovative technology and methods, such as: Infrastructure &amp; platform automation; Provisioning / scripting: Terraform, Ansible, Javascript (Node.JS), Go, Python, Bash; Orchestration / Containers: Docker, Kubernetes, Calico; Databases / DBA: Oracle, Postgres, MySQL, Mongo; Operating systems: ContainerLinux (CoreOS) and div. other linux distributions in containers; Cloud platforms: VMware vRealize, vCloud Director, Amazon, Azure. Software generation tools: Continuous Integration: Git, Maven, Make, Jenkins, Nexus, SonarQube, Selenium; XebiaLabs products: XL Release; Monitoring / logging: ElasticSearch, Fluentd, Kibana, SysDig; Working in Agile teams: Agile SCRUM process, DevOps; Working with Jira &amp; Confluence, Slack, Bitbucket, Github; TDD, BDD.</p>\n<h2>Work with your new colleagues.</h2>\n<p>There is a real engineering culture in KPN AppFactory's team. Highly educated researchers, designers, developers who spend 20% of their time exploring new technology. Kubernetes, Terraform, Cloud APIs, CI / CD have no more secrets to us. We regularly contribute in Open Source projects around datacenter automation. The engineering culture is also: 100% responsible for the platforms where mission critical applications of customers run. Building new functionality and improving the reliability of existing functionality. We build it, we run it.</p>\n<h2>What do you bring us?</h2>\n<p>For this vacancy of AppFactory Engineer at KPN you bring us:</p>\n<ul>\n<li>Knowledge of the above technologies and methods</li>\n<li>Passion for software engineering</li>\n<li>Drive for continuous improvements in team work</li>\n<li>Broad knowledge of software infrastructure technologies and experience with various software – production processes and technologies;</li>\n<li>Good communicative skills. You coordinate both the functional and technical aspects of the software within your team and with stakeholders outside the team.</li>\n</ul>\n<h2>We can also count on your:</h2>\n<ul>\n<li>\"Can-do\" mentality and acting according to the Agile and LEAN principles;</li>\n<li>Willingness to run \"stand-by\" services.</li>\n<li>Good command of the Dutch and English language in word &amp; script</li>\n</ul>\n<h2>What do you get in return?</h2>\n<ul>\n<li>A competitive salary</li>\n<li>A mobile phone and laptop</li>\n<li>148 free hours per year (with the possibility to buy hours)</li>\n<li>Working at home opportunities</li>\n<li>Flexible working hours</li>\n<li>A supplement of 12.5% ​​of your gross monthly salary (collective labor agreement)</li>\n<li>50% discount on KPN products and services</li>\n<li>Excellent pension conditions</li>\n<li>Good growth and training opportunities (KPN Academy) and an annual personal training budget of € 1.000, –</li>\n<li>These employment conditions are part of a full-time employment contract of 37 hours per week.</li>\n</ul>\n<p>Do you want to be at the basis of the new possibilities? Discover how much impact you can have as an AppFactory Engineer at KPN. This voyage of discovery starts with your job application via the application form.</p>\n<p>For questions, please contact Sylvia Kornet directly via <a href=\"mailto:sylvia.kornet@kpn.com\">sylvia.kornet@kpn.com</a>.</p>\n<p><a href=\"https://kpn.redirect.your-jobresponse.com/senior_appfactory_engineer_amsterdam/243025/V819/solliciteren\">Click here for the application form!</a></p>\n<p>Good to know:</p>\n<p>An (e-) assessment and screening are part of KPN's application process.</p>\n",
    "how_to_apply": "<p><a href=\"https://kpn.redirect.your-jobresponse.com/senior_appfactory_engineer_amsterdam/243025/V819/solliciteren\">Click here for the application form!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWxlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fd947acd47215ec5f9d7ca1a40af56106e867e10/kpn%201.jpeg"
  },
  {
    "id": "3b8bfce9-4f43-4f79-9763-42727aa8dd8c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3b8bfce9-4f43-4f79-9763-42727aa8dd8c",
    "created_at": "Wed Feb 13 01:01:33 UTC 2019",
    "company": "CyberLock",
    "company_url": "http://www.cyberlock.com",
    "location": "Corvallis, OR",
    "title": "Software Engineer",
    "description": "<p>SOFTWARE ENGINEER</p>\n<p>The position requires:</p>\n<ul>\n<li>Deep knowledge and experience developing server and embedded software for Linux platforms.</li>\n<li>Knowledge and experience building rpms and deb packages for commercial distribution.</li>\n<li>Fluency with the MySQL/MariaDB database engine as well as Sqlite.</li>\n<li>Knowledge and experience with Java, PHP, Javascript.</li>\n<li>Knowledge and experience building web servers.</li>\n</ul>\n<p>Essential Duties and Responsibilities:</p>\n<ul>\n<li>Design, develop, test, debug, and refine software and embedded platforms</li>\n<li>Optimize code and graphics to ensure optimal page load time</li>\n<li>Complete thorough testing and QA for all applicable software applications</li>\n<li>Understand usability and ensure a positive online experience for all users of the developed software</li>\n<li>Keep current on emerging technologies and learn new skills quickly</li>\n<li>Strong troubleshooting, problem solving and analytical skills</li>\n<li>Self-driven and proactive with the ability to work both independently and in groups</li>\n<li>Ability to manage multiple projects, deadlines and priorities</li>\n<li>Excellent oral and written communication skills</li>\n</ul>\n<p>Required Education, Knowledge, Skills, Abilities and/or Education/Experience:</p>\n<p>BS in computer science/engineering or related field\n2-4 years experience with the above position requirements</p>\n<p>How to apply:</p>\n<ul>\n<li>Send cover letter and resume in WORD or PDF format to: <a href=\"mailto:hrjobs@cyberlock.com\">hrjobs@cyberlock.com</a>.</li>\n<li>Please include the position you are applying for in the subject line of your email.</li>\n</ul>\n<p>This job description in no way states or implies that these are the only duties to be performed by the employee(s) incumbent in this position.  Employee(s) will be required to perform any other job related duties requested by any person authorized to give this employee instructions or assignments.  This document does not create an employment contract, implied or otherwise, other than an “at will” relationship.</p>\n",
    "how_to_apply": "<p>email your resume to <a href=\"mailto:hrjobs@cyberlock.com\">hrjobs@cyberlock.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDVlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--757790953f266821ff2c0a334b953b044a188297/Logo_gold_black.png"
  },
  {
    "id": "e48c1ccd-6c7b-436d-81d5-7ebf93b348f1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e48c1ccd-6c7b-436d-81d5-7ebf93b348f1",
    "created_at": "Tue Feb 12 21:12:14 UTC 2019",
    "company": "Shore Consulting Group",
    "company_url": "http://shore.ca",
    "location": "Toronto",
    "title": "Full Stack Ruby on Rails Developer",
    "description": "<p>Shore is an IT and strategy consulting firm focusing on innovation in the public sector. We deliver services and tools that advance public sector organizations and the services they provide.</p>\n<p>Shore’s working environment is flexible, collaborative, and down to earth. We work hard and deliver exceptional quality, but don’t take ourselves too seriously in doing so.</p>\n<p>The Full Stack Ruby on Rails Developer would join our Digital Delivery practice and contribute to the design and development of internal and client-facing applications.</p>\n<p>What it’s like to work at Shore:</p>\n<ul>\n<li>Flexible culture and working environment</li>\n<li>Opportunities to learn and advance</li>\n<li>Contribute to innovative projects</li>\n<li>Be encouraged to bring your own ideas forward</li>\n</ul>\n<p>Minimum qualifications:</p>\n<ul>\n<li>2+ Years of Experience with Ruby on Rails</li>\n<li>1+ Years with front-end technologies (Webpack, VueJs/React/Angular)</li>\n<li>Experience with Linux</li>\n<li>Experience with RDBMS (Postgresql preferred)</li>\n<li>Experience with Redis</li>\n<li>Strong understanding of asynchronous programming</li>\n<li>Exceptional understanding of the basics of front-end technologies such as JavaScript, HTML5, CSS3</li>\n<li>Proficient with Git</li>\n</ul>\n<p>Highly desired:</p>\n<ul>\n<li>Keen eye for UI/UX design</li>\n<li>Experience with performance debugging and benchmarking</li>\n<li>Experience with other languages and web frameworks such as django (Python), (Spring Framework) Java, Sinatra (Ruby)</li>\n<li>Some understanding of DevOps practices with a willingness to get your hands dirty with day to day devops. Working with GitLab CI, Chef, docker</li>\n</ul>\n<p>What your day would look like:</p>\n<ul>\n<li>Involvement in architecting, developing, reviewing, and testing of new features for internal and client-based projects</li>\n<li>Primary focus on our main application developed using Ruby on Rails and VueJS</li>\n<li>Interaction with clients as part of the development team where necessary</li>\n<li>Option to attend team-building events (dinner/drinks, game nights, the occasional trip around Toronto)</li>\n<li>Flexible work environment (i.e. flex hours)</li>\n<li>Semi-frequently \"do what you want\" Fridays, where you can initiate or work on other Shore projects of your choice</li>\n<li>Over time, you would ramp up involvement with general office and server infrastructure maintenance</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume along with a cover letter outlining why you're a good fit to <a href=\"mailto:jobs@shorecg.com\">jobs@shorecg.com</a>.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHRlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--928e35df61a5a2fb287e57845ca9ec200f4ab460/Shore%20logo%202.png"
  },
  {
    "id": "fe611414-9e79-4f44-a21b-f7e5d5a460b2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/fe611414-9e79-4f44-a21b-f7e5d5a460b2",
    "created_at": "Tue Feb 12 20:23:06 UTC 2019",
    "company": "Shore Consulting Group",
    "company_url": "http://shore.ca",
    "location": "Toronto, ON",
    "title": "Senior Front-End Developer",
    "description": "<p>Shore is an IT and strategy consulting firm focusing on innovation in the public sector. We deliver services and tools that advance public sector organizations and the services they provide.\nShore’s working environment is flexible, collaborative, and down to earth. We work hard and deliver exceptional quality, but don’t take ourselves too seriously in doing so.</p>\n<p>Job Purpose: The position is responsible for independently analyzing, developing, testing, and supporting highly complex application software. The successful candidate will work with project teams and help develop strategies for developing complex applications.</p>\n<p>What it’s like to work at Shore:</p>\n<ul>\n<li>Flexible culture and working environment</li>\n<li>Opportunities to learn and advance</li>\n<li>Contribute to innovative projects and work with the newest technologies</li>\n<li>Be encouraged to bring your own ideas forward</li>\n</ul>\n<p>Primary responsibilities:\nThis role is demanding and diverse, with the following responsibilities:</p>\n<ul>\n<li>Designs, analyzes, and documents software applications across multiple project teams and applications:</li>\n<li>Investigates and analyzes verbal and written requests for application software.</li>\n<li>Works in tandem with UX designer to interpret application requirements to construct UIs for highly complex applications.</li>\n<li>Maintains high standards of quality for code, functional specification documentation, and deliverables.</li>\n<li>Constructs, tests, deploys, and maintains web applications:</li>\n<li>Adheres to industry best practices and contributes to internal coding standards.</li>\n<li>Develops highly complex software code, which is maintainable, easy to use, and satisfies application requirements.</li>\n<li>Develops and executes application test plans, analyzes test results, and makes appropriate revisions to ensure the applications function as specified.</li>\n<li>Contributes to the planning for acceptance testing and implementation of new software, performing supporting activities to ensure that customers have the information and assistance they need for a successful implementation.</li>\n<li>Writes automated UI tests.</li>\n<li>Provides support to internal users and support staff.</li>\n<li>Researches, assesses and facilitates the adoption of new technologies.</li>\n<li>Works with and, in some instances, provides work direction to our vendor partners.</li>\n<li>Other duties as assigned.</li>\n</ul>\n<p>Key qualifications</p>\n<ul>\n<li>Bachelor of Science degree in Computer Science or similar</li>\n<li>5+ years of experience in front-end development using modern JavaScript frameworks such as VueJS, React, Ember, Angular</li>\n<li>Extensive experience with HTML5, CSS3</li>\n<li>Exceptional understanding of OOP in JavaScript</li>\n<li>Understanding of MVC/MVVM patterns</li>\n<li>Experience with RESTful APIs</li>\n<li>Experience testing JavaScript applications (Unit, E2E, UI)</li>\n<li>Knowledge of accessibility requirements on the web</li>\n<li>Experience with testing frameworks (Jasmine, Cucumber, Selenium)</li>\n<li>Understanding of webservers - application hosting / deployment practices</li>\n<li>Good knowledge of UNIX / Linux – shell scripting, code deployment and management</li>\n<li>Practical knowledge of MySQL / SQL Server</li>\n<li>Knowledge of Ruby and/or Python is an asset</li>\n<li>Good communication skills and ability to work independently</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume and cover letter outlining why you're a good fit to <a href=\"mailto:jobs@shorecg.com\">jobs@shorecg.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGRlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8a2a820d29748da3e28cecfb839138ae89a56f00/Shore%20logo%202.png"
  },
  {
    "id": "dbfc02f2-fd77-11e3-9627-a101934ea25e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/dbfc02f2-fd77-11e3-9627-a101934ea25e",
    "created_at": "Tue Oct 23 16:21:20 UTC 2018",
    "company": "Sharethrough",
    "company_url": "http://Sharethrough",
    "location": "San Francisco",
    "title": "Backend Engineering (Scala+)",
    "description": "<p>As an engineer on the Sharethrough Exchange team at Sharethrough, you’ll build out our highly scalable service infrastructure, generating insights used by top publishers and brands on the open web, powering critical revenue behind companies like Disney, CNN, VICE, and CBSi.  You'll be a key contributor to our Scala-based backend services that make thousands of complex, real-time decisions per second possible. Large-scale distributed, high performance = those are the problems you can solve on the team.</p>\n<p><strong>What You'll Be Doing</strong></p>\n<ul>\n<li>\n<strong>Having a say:</strong> You’ll participate in problem definition and solution with a diverse group of engineers, designers and business owners from around the company.</li>\n<li>\n<strong>Proper engineering:</strong> Writing Scala-based pipeline processing and infrastructure that is performant, well-tested, and easy to maintain. We value teamwork and experimentation to achieve the best outcomes.</li>\n<li>\n<strong>Technical heavy lifting:</strong> You’ll architect and implement major components of an ambitious distributed system at scale.</li>\n</ul>\n<p><strong>Let's Talk If</strong></p>\n<ul>\n<li>\n<strong>You’ve shipped software:</strong> You have production experience with large-scale distributed systems and are excited to explore new technologies that can push the boundaries of efficiency.</li>\n<li>\n<strong>You care about code:</strong> You take pride in engineering, and have a deep understanding of how to write high quality, maintainable, extensible software in a collaborative environment.</li>\n<li>\n<strong>You like moving quickly:</strong> We push to production on every commit via our  continuous integration and deployment pipeline and value truly immutable infrastructure.</li>\n</ul>\n<p><strong>Why You'll Love Working at Sharethrough</strong></p>\n<ul>\n<li>\n<strong>Values-driven culture:</strong> You’d be walking into a welcoming and diverse environment that is built around action, optimism, purpose and transparency.  We have a fun, supportive culture, and firmly believe in what we’re doing.</li>\n<li>\n<strong>Marry the problem, not the solution:</strong> We’re constantly re-evaluating our technical infrastructure to deliver faster, better, and more reliable software.</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github\">https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c05f76669a8a274c3fae7dc7128d140337838a2/ffeaf00c-0450-4d8f-b620-ef1a1742675c"
  },
  {
    "id": "4de9d608-127f-40c3-9891-f9a66396153f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4de9d608-127f-40c3-9891-f9a66396153f",
    "created_at": "Tue Feb 12 16:10:44 UTC 2019",
    "company": "Meredith Corporation",
    "company_url": "http:",
    "location": "Manhattan, NY",
    "title": "Front End Software Engineer",
    "description": "<p>Are you a Technologist with a passion for problem-solving, learning new things and excited about creating web experiences that will be viewed by millions!? We would love for you to join our dynamic team in downtown Manhattan!</p>\n<p>Who we are?</p>\n<p>We are Meredith Corporation, a leading media + marketing company on the pulse of pop culture, entertainment, food, fashion, and lifestyle. Meredith is a Top 10 digital media company with exciting brands such as Allrecipes. People, InStyle and SO MUCH MORE!</p>\n<p>What is in it for you?</p>\n<p>*Collaborative teamwork environment where we share wins (and sometimes losses, everyone makes mistakes!)</p>\n<p>*Competitive wages and a robust benefits package</p>\n<p>*Career path progression (we WANT you to succeed)</p>\n<p>*We keep sane hours so you can spend more time doing what you love...(walking the dog, traveling, starting a community garden, etc.)</p>\n<p>What we are looking for in a candidate -</p>\n<p>*Passionate about front-end software development with at least 2 years of experience</p>\n<p>*Javascript development knowledge</p>\n<p>*Previously interacted with REST APIs</p>\n<p>*Practical knowledge of Git, Github and version control</p>\n<p>*Enjoys working within an Agile methodology</p>\n<p>If you would like to hear more please apply!</p>\n<p>You can also connect with me on LinkedIn at <a href=\"https://www.linkedin.com/in/atenborg/\">https://www.linkedin.com/in/atenborg/</a></p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:andrea.tenborg@meredith.com\">andrea.tenborg@meredith.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEJlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb03b991909c69cfcfd94fb2366820f2cb52b036/MRD-Logo-300x300px%20LINKEDIN.PNG"
  },
  {
    "id": "21210eaa-b399-4276-8b38-b36687f73c53",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/21210eaa-b399-4276-8b38-b36687f73c53",
    "created_at": "Tue Feb 12 15:15:28 UTC 2019",
    "company": "moovel Group GmbH",
    "company_url": "https://www.moovel.com/de/DE",
    "location": "Berlin",
    "title": "Kotlin Backend Developer - Mobility Payments (f/m/d)",
    "description": "<p>Hi, we are Simon, Patrick, and William of moovel’s pay squad.</p>\n<p>Together we develop the payment backend that customers use to pay for mobility services like car2go, mytaxi, and public transport.</p>\n<p>We are looking for a skilled and independently working Kotlin developer. The ideal candidate would be interested in building software in a microservice architecture—together with different teams at moovel.</p>\n<p>Although knowledge in Kotlin is not a hard requirement for this position—especially if you are fluent in other JVM languages like Scala or Java—you should know it’ll be the main coding language deployed here</p>\n<h2>First a quick look at us</h2>\n<p>Our vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions.</p>\n<p>We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture. We also put emphasis on fun and play.</p>\n<p>We are a partner for cities, transport networks, and customers working to make cities smarter. Part of that involves creating an operating system for urban mobility. One that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles.</p>\n<p>Currently, 250 employees work in small creative teams in Germany and the US at four locations—Hamburg, Berlin, Stuttgart, and Portland.</p>\n<h2>How the role will work</h2>\n<p>As part of a cross-functional team, you’ll be responsible for developing and maintaining services in our microservice-based architecture, currently with Java/Kotlin.</p>\n<p>We are looking for someone who likes to do challenging and high-demand work in an experienced work environment. You should be someone who loves to bring in and share your experience and new ideas, to push for new processes and improve them. You’ll shape the product by contributing your ideas to our payment solutions while bringing your projects from development to production (continuous deployment).</p>\n<h2>Some of the things you will do</h2>\n<p>Breaking down concrete tasks for this position is not that easy, but that's what makes it so exciting.</p>\n<ul>\n<li>Here are some things we’ll entrust you with right away:</li>\n<li>Building and maintaining systems in a distributed and cloud-based environment.</li>\n<li>Shaping the product by contributing your ideas to our payment services in the mobility space</li>\n<li>Accompanying your products from development to production (continuous deployment).</li>\n</ul>\n<h2>About you</h2>\n<ul>\n<li>You have strong technical skills in Kotlin/Java/JVM/Spring/Postgres as well as experience and knowledge of microservices architecture. Excellent awareness of architecture and code quality are really important for us. Just as important as work experience with agile methodologies.</li>\n<li>You should be open to learn new languages and frameworks and to be able to work in a rapidly changing startup environment</li>\n<li>As our corporate language is English, you should have good written and verbal communication skills in English</li>\n<li>We work with Amazon Web Services so it’s a plus if you are familiar with that as well and have experience with web frontend development (Angular/React)</li>\n</ul>\n<p>In summary, we are looking for a pioneer who loves working on products with impact and leading a motivated and ambitious team with a modern leadership style. If this letter speaks to you and you are more than ready for this challenge—we definitely want to meet you. Because we can already say that there is an exciting journey ahead of us.</p>\n<p>We can’t wait to meet you! Apply now by using the application form.</p>\n<p>Yours,</p>\n<p>Simon, William and Patrick</p>\n<p><a href=\"https://moovelgroup.redirect.your-jobresponse.com/kotlin_backend_developer_mobility_payments_f_m_d_berlin/243005/V819/anwenden\">Click here for the application form!</a></p>\n<p>If you have any questions or are in need for further information feel free to contact Nicole\nArmatowski +49 711 219 53941</p>\n",
    "how_to_apply": "<p><a href=\"https://moovelgroup.redirect.your-jobresponse.com/kotlin_backend_developer_mobility_payments_f_m_d_berlin/243005/V819/anwenden\">Click here for the application form!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3BlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3e80ac11c28f7fe27c9db28a7262e12811d4c973/Moovel.png"
  },
  {
    "id": "4cacd82f-2bbe-4375-9ce7-2fbfd3d88c03",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4cacd82f-2bbe-4375-9ce7-2fbfd3d88c03",
    "created_at": "Tue Feb 12 14:04:15 UTC 2019",
    "company": "Thorlabs",
    "company_url": "https://www.thorlabs.com/",
    "location": "Sterling, Virginia ",
    "title": "Software Engineer",
    "description": "<p>The position works with the Software team to develop and maintain life-science imaging platforms. The ideal candidate for this role will be someone who has strong C#/C++ development skills and experience designing Windows based instrumentation systems. Although the location of the position is in Sterling, VA, from time to time it may be required to undertake duties at other ThorLabs locations.</p>\n<p>Essential Job Functions include the following, but are not limited to:</p>\n<p>Document requirements and design specifications as well as verification plans and test cases\nParticipate in code, design and architectural reviews\nPerform coding and unit tests of requirements as they are defined\nDevice driver design and implementation\nSoftware testing and assisting with validation of system design\nAssist with project planning, estimation and tracking\nReport development status to supervisor on a regular basis\nMaintain an orderly laboratory notebook and design history file\nAssist both the service and manufacturing departments in troubleshooting technical problems with software. This includes training of personnel\nRecommend innovations and improved methods, tools, and processes\nPerform other related duties and assignments as required\nQualifications</p>\n<p>Experience:</p>\n<p>At least 3+ years of proven experience in commercial software design, development, and implementation\nEducation:</p>\n<p>Minimum of a BS or MS in Computer Science, Engineering or related field required\nSpecialized Knowledge and Skills:</p>\n<p>Must be fluent programming in C# and/or C++, and have a solid command of object oriented design principles\nExperience with image analysis/processing is a plus\nExperience with Matlab is a plus.\nExperience with WPF is a plus\nIn-depth knowledge of building software on Windows Win7/Win10\nMust have excellent verbal, written and listening skills.\nMust be able to work effectively with others both within and external to the engineering group\nMust possess the ability to quickly and creatively solve unexpected problems using strong analytical skills\nThe candidate is expected to take the initiative to anticipate or avoid potential problems</p>\n<p>Thorlabs values its diverse environment and is proud to be an Equal Employment Opportunity/Affirmative Action employer. All qualified individuals will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status. Job descriptions are not intended as and do not create employment contracts. The organization maintains its status as an at-will employer. Employees can be terminated for any reason not prohibited by law.</p>\n",
    "how_to_apply": "<p>Please be sure to complete an application on the company's career site for consideration:\n<a href=\"https://www.appone.com/MainInfoReq.asp?R_ID=2282543\">https://www.appone.com/MainInfoReq.asp?R_ID=2282543</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa05lIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1ec0221cc8ee728132b54c47bafde6ea0ee49b91/Company%20Logo.jpg"
  },
  {
    "id": "44ae03a3-ff2c-4eb1-a108-6dda5be0b223",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/44ae03a3-ff2c-4eb1-a108-6dda5be0b223",
    "created_at": "Tue Feb 12 13:43:46 UTC 2019",
    "company": "PAF (Ålands Penningautomatförening)",
    "company_url": "https://www.paf.com/",
    "location": "Helsinki",
    "title": "Senior SW Developer/Team Technical Lead (Java/AWS/Microservices transition)",
    "description": "<p>For our Integrations team in Helsinki we are looking for a Senior Software Developer/Team Technical Lead. You will be part of the Integrations team at Paf and will work with complex software integrations in an easy-going, collaborative and informal atmosphere. You will collaborate with experienced developers and architects to develop and improve the Paf systems. We actively discuss, plan and share knowledge within and outside the team. We handle the 3rd party game integrations.</p>\n<p>You will lead the work in one of our scrum teams and actively communicate with 3rd party suppliers and partners. You will contribute to the whole system development chain from requirement analysis to design, implementation and quality assurance. Your focus will be in developing new integrations and tools, as well as maintain our current solutions.</p>\n<p>We are in the middle of moving from a hardware-based infrastructure, to a cloud-based, microservice based architecture, so you will get the chance to start to learn about our legacy system, develop our offers and yourself, and be a part of our journey into the future.</p>\n<p>What’s in it for you?</p>\n<p>You will join an agile cross-functional development team in our office in central Helsinki. You get to work with the latest in microservices and container technologies and on all parts of the technology stack. You will learn new things and grow as a professional, especially in mentoring junior talent. We value diversity in our multicultural workplace and look positively on a gender equal workplace. In addition to a competitive salary, we also offer a benefits package with lunch coupons, sports benefits, occupational healthcare with extra insurance and more.</p>\n<p>What skills are needed?</p>\n<p>We are looking for skilled professionals with serious experience, for this role, we would like you to have:</p>\n<ul>\n<li>\n<p>8+ years of software development and software design with industry experience in shipping and maintaining products</p>\n</li>\n<li>\n<p>5+ years of experience with Java and SpringBoot</p>\n</li>\n<li>\n<p>5+ years of experience with Docker, Rancher, Swagger</p>\n</li>\n<li>\n<p>5+ years of experience with web technologies such as SOAP, JS, HTML5, CSS, REST, and modern open-source web frameworks</p>\n</li>\n<li>\n<p>5+ years of experience in working with Agile methods, preferably Scrum</p>\n</li>\n<li>\n<p>3+ years of experience with Microservice Architecture</p>\n</li>\n<li>\n<p>3+ years of experience with transaction centric systems</p>\n</li>\n<li>\n<p>Experience in Gatling, Jenkins, GIT and Bitbucket</p>\n</li>\n<li>\n<p>Experience in PostgreSQL</p>\n</li>\n<li>\n<p>Good communication skills in English. Swedish and/or Finnish is a merit. Excellent interpersonal skills, as mentoring is a requirement, and proactive in involving internal and external people</p>\n</li>\n<li>\n<p>Understanding of business as the driving force for development</p>\n</li>\n<li>\n<p>An attitude of flexibility and perseverance to get stuff done</p>\n</li>\n<li>\n<p>Ability to see the bigger picture</p>\n</li>\n</ul>\n<p>Nice to have:</p>\n<ul>\n<li>\n<p>Experience on mobile, HTML5, VueJS etc.</p>\n</li>\n<li>\n<p>SCALA and Gatling programming skills</p>\n</li>\n</ul>\n<p>Interested? Submit your application on-line by March 3rd, 2019. All communication and applications will be treated confidentially. For more information, please contact our recruitment partner Arja Martikainen arja.martikainen(at)barona.fi or call +358 40 7621564 Tue-Thu between 2 and 3 pm.</p>\n",
    "how_to_apply": "<p><a href=\"https://ura.barona.fi/application/5c5c43166f47a1001efd9882\">https://ura.barona.fi/application/5c5c43166f47a1001efd9882</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajVlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b09faf2d13366e4d2d4054ac9aec0aeff3b9dd6a/paf-logo.png"
  }
]